graph inception_resnetv2 (
  %input_2[FLOAT, Nx299x299x3]
) initializers (
  %predictions_1/kernel:0[FLOAT, 1536x1000]
  %predictions_1/bias:0[FLOAT, 1000]
  %conv_7b_ac/Relu:0_reshape_start[INT64, 2]
  %scale[FLOAT, 1536]
  %bias[FLOAT, 1536]
  %mean[FLOAT, 1536]
  %var[FLOAT, 1536]
  %conv_7b/kernel:0[FLOAT, 1536x2080x1x1]
  %TFNodes/block8_10/mul/y:0[FLOAT, scalar]
  %block8_10_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_10_conv/bias:0[FLOAT, 2080]
  %TFNodes1/block8_9/mul/y:0[FLOAT, scalar]
  %block8_9_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_9_conv/bias:0[FLOAT, 2080]
  %TFNodes2/block8_8/mul/y:0[FLOAT, scalar]
  %scale1[FLOAT, 192]
  %bias1[FLOAT, 192]
  %mean1[FLOAT, 192]
  %var1[FLOAT, 192]
  %scale2[FLOAT, 256]
  %bias2[FLOAT, 256]
  %mean2[FLOAT, 256]
  %var2[FLOAT, 256]
  %block8_8_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_8_conv/bias:0[FLOAT, 2080]
  %conv2d_294/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_297/kernel:0[FLOAT, 256x224x3x1]
  %TFNodes3/block8_7/mul/y:0[FLOAT, scalar]
  %scale3[FLOAT, 192]
  %bias3[FLOAT, 192]
  %mean3[FLOAT, 192]
  %var3[FLOAT, 192]
  %scale4[FLOAT, 256]
  %bias4[FLOAT, 256]
  %mean4[FLOAT, 256]
  %var4[FLOAT, 256]
  %block8_7_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_7_conv/bias:0[FLOAT, 2080]
  %conv2d_290/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_293/kernel:0[FLOAT, 256x224x3x1]
  %scale5[FLOAT, 224]
  %bias5[FLOAT, 224]
  %mean5[FLOAT, 224]
  %var5[FLOAT, 224]
  %TFNodes4/block8_6/mul/y:0[FLOAT, scalar]
  %scale6[FLOAT, 192]
  %bias6[FLOAT, 192]
  %mean6[FLOAT, 192]
  %var6[FLOAT, 192]
  %scale7[FLOAT, 256]
  %bias7[FLOAT, 256]
  %mean7[FLOAT, 256]
  %var7[FLOAT, 256]
  %conv2d_296/kernel:0[FLOAT, 224x192x1x3]
  %block8_6_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_6_conv/bias:0[FLOAT, 2080]
  %conv2d_286/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_289/kernel:0[FLOAT, 256x224x3x1]
  %scale8[FLOAT, 224]
  %bias8[FLOAT, 224]
  %mean8[FLOAT, 224]
  %var8[FLOAT, 224]
  %TFNodes5/block8_5/mul/y:0[FLOAT, scalar]
  %scale9[FLOAT, 192]
  %bias9[FLOAT, 192]
  %mean9[FLOAT, 192]
  %var9[FLOAT, 192]
  %scale10[FLOAT, 256]
  %bias10[FLOAT, 256]
  %mean10[FLOAT, 256]
  %var10[FLOAT, 256]
  %conv2d_292/kernel:0[FLOAT, 224x192x1x3]
  %scale11[FLOAT, 192]
  %bias11[FLOAT, 192]
  %mean11[FLOAT, 192]
  %var11[FLOAT, 192]
  %block8_5_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_5_conv/bias:0[FLOAT, 2080]
  %conv2d_282/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_285/kernel:0[FLOAT, 256x224x3x1]
  %scale12[FLOAT, 224]
  %bias12[FLOAT, 224]
  %mean12[FLOAT, 224]
  %var12[FLOAT, 224]
  %conv2d_295/kernel:0[FLOAT, 192x2080x1x1]
  %TFNodes6/block8_4/mul/y:0[FLOAT, scalar]
  %scale13[FLOAT, 192]
  %bias13[FLOAT, 192]
  %mean13[FLOAT, 192]
  %var13[FLOAT, 192]
  %scale14[FLOAT, 256]
  %bias14[FLOAT, 256]
  %mean14[FLOAT, 256]
  %var14[FLOAT, 256]
  %conv2d_288/kernel:0[FLOAT, 224x192x1x3]
  %scale15[FLOAT, 192]
  %bias15[FLOAT, 192]
  %mean15[FLOAT, 192]
  %var15[FLOAT, 192]
  %block8_4_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_4_conv/bias:0[FLOAT, 2080]
  %conv2d_278/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_281/kernel:0[FLOAT, 256x224x3x1]
  %scale16[FLOAT, 224]
  %bias16[FLOAT, 224]
  %mean16[FLOAT, 224]
  %var16[FLOAT, 224]
  %conv2d_291/kernel:0[FLOAT, 192x2080x1x1]
  %TFNodes7/block8_3/mul/y:0[FLOAT, scalar]
  %scale17[FLOAT, 192]
  %bias17[FLOAT, 192]
  %mean17[FLOAT, 192]
  %var17[FLOAT, 192]
  %scale18[FLOAT, 256]
  %bias18[FLOAT, 256]
  %mean18[FLOAT, 256]
  %var18[FLOAT, 256]
  %conv2d_284/kernel:0[FLOAT, 224x192x1x3]
  %scale19[FLOAT, 192]
  %bias19[FLOAT, 192]
  %mean19[FLOAT, 192]
  %var19[FLOAT, 192]
  %block8_3_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_3_conv/bias:0[FLOAT, 2080]
  %conv2d_274/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_277/kernel:0[FLOAT, 256x224x3x1]
  %scale20[FLOAT, 224]
  %bias20[FLOAT, 224]
  %mean20[FLOAT, 224]
  %var20[FLOAT, 224]
  %conv2d_287/kernel:0[FLOAT, 192x2080x1x1]
  %TFNodes8/block8_2/mul/y:0[FLOAT, scalar]
  %scale21[FLOAT, 192]
  %bias21[FLOAT, 192]
  %mean21[FLOAT, 192]
  %var21[FLOAT, 192]
  %scale22[FLOAT, 256]
  %bias22[FLOAT, 256]
  %mean22[FLOAT, 256]
  %var22[FLOAT, 256]
  %conv2d_280/kernel:0[FLOAT, 224x192x1x3]
  %scale23[FLOAT, 192]
  %bias23[FLOAT, 192]
  %mean23[FLOAT, 192]
  %var23[FLOAT, 192]
  %block8_2_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_2_conv/bias:0[FLOAT, 2080]
  %conv2d_270/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_273/kernel:0[FLOAT, 256x224x3x1]
  %scale24[FLOAT, 224]
  %bias24[FLOAT, 224]
  %mean24[FLOAT, 224]
  %var24[FLOAT, 224]
  %conv2d_283/kernel:0[FLOAT, 192x2080x1x1]
  %TFNodes9/block8_1/mul/y:0[FLOAT, scalar]
  %scale25[FLOAT, 192]
  %bias25[FLOAT, 192]
  %mean25[FLOAT, 192]
  %var25[FLOAT, 192]
  %scale26[FLOAT, 256]
  %bias26[FLOAT, 256]
  %mean26[FLOAT, 256]
  %var26[FLOAT, 256]
  %conv2d_276/kernel:0[FLOAT, 224x192x1x3]
  %scale27[FLOAT, 192]
  %bias27[FLOAT, 192]
  %mean27[FLOAT, 192]
  %var27[FLOAT, 192]
  %block8_1_conv/kernel:0[FLOAT, 2080x448x1x1]
  %block8_1_conv/bias:0[FLOAT, 2080]
  %conv2d_266/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_269/kernel:0[FLOAT, 256x224x3x1]
  %scale28[FLOAT, 224]
  %bias28[FLOAT, 224]
  %mean28[FLOAT, 224]
  %var28[FLOAT, 224]
  %conv2d_279/kernel:0[FLOAT, 192x2080x1x1]
  %scale29[FLOAT, 192]
  %bias29[FLOAT, 192]
  %mean29[FLOAT, 192]
  %var29[FLOAT, 192]
  %scale30[FLOAT, 256]
  %bias30[FLOAT, 256]
  %mean30[FLOAT, 256]
  %var30[FLOAT, 256]
  %conv2d_272/kernel:0[FLOAT, 224x192x1x3]
  %scale31[FLOAT, 192]
  %bias31[FLOAT, 192]
  %mean31[FLOAT, 192]
  %var31[FLOAT, 192]
  %scale32[FLOAT, 384]
  %bias32[FLOAT, 384]
  %mean32[FLOAT, 384]
  %var32[FLOAT, 384]
  %scale33[FLOAT, 288]
  %bias33[FLOAT, 288]
  %mean33[FLOAT, 288]
  %var33[FLOAT, 288]
  %scale34[FLOAT, 320]
  %bias34[FLOAT, 320]
  %mean34[FLOAT, 320]
  %var34[FLOAT, 320]
  %conv2d_262/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_265/kernel:0[FLOAT, 256x224x3x1]
  %scale35[FLOAT, 224]
  %bias35[FLOAT, 224]
  %mean35[FLOAT, 224]
  %var35[FLOAT, 224]
  %conv2d_275/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_252/kernel:0[FLOAT, 384x256x3x3]
  %conv2d_254/kernel:0[FLOAT, 288x256x3x3]
  %conv2d_257/kernel:0[FLOAT, 320x288x3x3]
  %TFNodes10/block17_20/mul/y:0[FLOAT, scalar]
  %scale36[FLOAT, 192]
  %bias36[FLOAT, 192]
  %mean36[FLOAT, 192]
  %var36[FLOAT, 192]
  %scale37[FLOAT, 256]
  %bias37[FLOAT, 256]
  %mean37[FLOAT, 256]
  %var37[FLOAT, 256]
  %conv2d_268/kernel:0[FLOAT, 224x192x1x3]
  %scale38[FLOAT, 192]
  %bias38[FLOAT, 192]
  %mean38[FLOAT, 192]
  %var38[FLOAT, 192]
  %block17_20_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_20_conv/bias:0[FLOAT, 1088]
  %conv2d_258/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_261/kernel:0[FLOAT, 256x224x3x1]
  %scale39[FLOAT, 224]
  %bias39[FLOAT, 224]
  %mean39[FLOAT, 224]
  %var39[FLOAT, 224]
  %conv2d_271/kernel:0[FLOAT, 192x2080x1x1]
  %scale40[FLOAT, 256]
  %bias40[FLOAT, 256]
  %mean40[FLOAT, 256]
  %var40[FLOAT, 256]
  %scale41[FLOAT, 256]
  %bias41[FLOAT, 256]
  %mean41[FLOAT, 256]
  %var41[FLOAT, 256]
  %scale42[FLOAT, 288]
  %bias42[FLOAT, 288]
  %mean42[FLOAT, 288]
  %var42[FLOAT, 288]
  %TFNodes11/block17_19/mul/y:0[FLOAT, scalar]
  %conv2d_264/kernel:0[FLOAT, 224x192x1x3]
  %scale43[FLOAT, 192]
  %bias43[FLOAT, 192]
  %mean43[FLOAT, 192]
  %var43[FLOAT, 192]
  %conv2d_251/kernel:0[FLOAT, 256x1088x1x1]
  %conv2d_253/kernel:0[FLOAT, 256x1088x1x1]
  %conv2d_256/kernel:0[FLOAT, 288x256x3x3]
  %block17_19_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_19_conv/bias:0[FLOAT, 1088]
  %scale44[FLOAT, 224]
  %bias44[FLOAT, 224]
  %mean44[FLOAT, 224]
  %var44[FLOAT, 224]
  %conv2d_267/kernel:0[FLOAT, 192x2080x1x1]
  %TFNodes12/block17_18/mul/y:0[FLOAT, scalar]
  %scale45[FLOAT, 192]
  %bias45[FLOAT, 192]
  %mean45[FLOAT, 192]
  %var45[FLOAT, 192]
  %scale46[FLOAT, 192]
  %bias46[FLOAT, 192]
  %mean46[FLOAT, 192]
  %var46[FLOAT, 192]
  %conv2d_260/kernel:0[FLOAT, 224x192x1x3]
  %scale47[FLOAT, 192]
  %bias47[FLOAT, 192]
  %mean47[FLOAT, 192]
  %var47[FLOAT, 192]
  %scale48[FLOAT, 256]
  %bias48[FLOAT, 256]
  %mean48[FLOAT, 256]
  %var48[FLOAT, 256]
  %block17_18_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_18_conv/bias:0[FLOAT, 1088]
  %conv2d_247/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_250/kernel:0[FLOAT, 192x160x7x1]
  %conv2d_263/kernel:0[FLOAT, 192x2080x1x1]
  %conv2d_255/kernel:0[FLOAT, 256x1088x1x1]
  %TFNodes13/block17_17/mul/y:0[FLOAT, scalar]
  %scale49[FLOAT, 192]
  %bias49[FLOAT, 192]
  %mean49[FLOAT, 192]
  %var49[FLOAT, 192]
  %scale50[FLOAT, 192]
  %bias50[FLOAT, 192]
  %mean50[FLOAT, 192]
  %var50[FLOAT, 192]
  %scale51[FLOAT, 192]
  %bias51[FLOAT, 192]
  %mean51[FLOAT, 192]
  %var51[FLOAT, 192]
  %block17_17_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_17_conv/bias:0[FLOAT, 1088]
  %conv2d_243/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_246/kernel:0[FLOAT, 192x160x7x1]
  %scale52[FLOAT, 160]
  %bias52[FLOAT, 160]
  %mean52[FLOAT, 160]
  %var52[FLOAT, 160]
  %conv2d_259/kernel:0[FLOAT, 192x2080x1x1]
  %TFNodes14/block17_16/mul/y:0[FLOAT, scalar]
  %scale53[FLOAT, 192]
  %bias53[FLOAT, 192]
  %mean53[FLOAT, 192]
  %var53[FLOAT, 192]
  %scale54[FLOAT, 192]
  %bias54[FLOAT, 192]
  %mean54[FLOAT, 192]
  %var54[FLOAT, 192]
  %conv2d_249/kernel:0[FLOAT, 160x128x1x7]
  %block17_16_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_16_conv/bias:0[FLOAT, 1088]
  %conv2d_239/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_242/kernel:0[FLOAT, 192x160x7x1]
  %scale55[FLOAT, 160]
  %bias55[FLOAT, 160]
  %mean55[FLOAT, 160]
  %var55[FLOAT, 160]
  %TFNodes15/block17_15/mul/y:0[FLOAT, scalar]
  %scale56[FLOAT, 192]
  %bias56[FLOAT, 192]
  %mean56[FLOAT, 192]
  %var56[FLOAT, 192]
  %scale57[FLOAT, 192]
  %bias57[FLOAT, 192]
  %mean57[FLOAT, 192]
  %var57[FLOAT, 192]
  %conv2d_245/kernel:0[FLOAT, 160x128x1x7]
  %scale58[FLOAT, 128]
  %bias58[FLOAT, 128]
  %mean58[FLOAT, 128]
  %var58[FLOAT, 128]
  %block17_15_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_15_conv/bias:0[FLOAT, 1088]
  %conv2d_235/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_238/kernel:0[FLOAT, 192x160x7x1]
  %scale59[FLOAT, 160]
  %bias59[FLOAT, 160]
  %mean59[FLOAT, 160]
  %var59[FLOAT, 160]
  %conv2d_248/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes16/block17_14/mul/y:0[FLOAT, scalar]
  %scale60[FLOAT, 192]
  %bias60[FLOAT, 192]
  %mean60[FLOAT, 192]
  %var60[FLOAT, 192]
  %scale61[FLOAT, 192]
  %bias61[FLOAT, 192]
  %mean61[FLOAT, 192]
  %var61[FLOAT, 192]
  %conv2d_241/kernel:0[FLOAT, 160x128x1x7]
  %scale62[FLOAT, 128]
  %bias62[FLOAT, 128]
  %mean62[FLOAT, 128]
  %var62[FLOAT, 128]
  %block17_14_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_14_conv/bias:0[FLOAT, 1088]
  %conv2d_231/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_234/kernel:0[FLOAT, 192x160x7x1]
  %scale63[FLOAT, 160]
  %bias63[FLOAT, 160]
  %mean63[FLOAT, 160]
  %var63[FLOAT, 160]
  %conv2d_244/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes17/block17_13/mul/y:0[FLOAT, scalar]
  %scale64[FLOAT, 192]
  %bias64[FLOAT, 192]
  %mean64[FLOAT, 192]
  %var64[FLOAT, 192]
  %scale65[FLOAT, 192]
  %bias65[FLOAT, 192]
  %mean65[FLOAT, 192]
  %var65[FLOAT, 192]
  %conv2d_237/kernel:0[FLOAT, 160x128x1x7]
  %scale66[FLOAT, 128]
  %bias66[FLOAT, 128]
  %mean66[FLOAT, 128]
  %var66[FLOAT, 128]
  %block17_13_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_13_conv/bias:0[FLOAT, 1088]
  %conv2d_227/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_230/kernel:0[FLOAT, 192x160x7x1]
  %scale67[FLOAT, 160]
  %bias67[FLOAT, 160]
  %mean67[FLOAT, 160]
  %var67[FLOAT, 160]
  %conv2d_240/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes18/block17_12/mul/y:0[FLOAT, scalar]
  %scale68[FLOAT, 192]
  %bias68[FLOAT, 192]
  %mean68[FLOAT, 192]
  %var68[FLOAT, 192]
  %scale69[FLOAT, 192]
  %bias69[FLOAT, 192]
  %mean69[FLOAT, 192]
  %var69[FLOAT, 192]
  %conv2d_233/kernel:0[FLOAT, 160x128x1x7]
  %scale70[FLOAT, 128]
  %bias70[FLOAT, 128]
  %mean70[FLOAT, 128]
  %var70[FLOAT, 128]
  %block17_12_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_12_conv/bias:0[FLOAT, 1088]
  %conv2d_223/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_226/kernel:0[FLOAT, 192x160x7x1]
  %scale71[FLOAT, 160]
  %bias71[FLOAT, 160]
  %mean71[FLOAT, 160]
  %var71[FLOAT, 160]
  %conv2d_236/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes19/block17_11/mul/y:0[FLOAT, scalar]
  %scale72[FLOAT, 192]
  %bias72[FLOAT, 192]
  %mean72[FLOAT, 192]
  %var72[FLOAT, 192]
  %scale73[FLOAT, 192]
  %bias73[FLOAT, 192]
  %mean73[FLOAT, 192]
  %var73[FLOAT, 192]
  %conv2d_229/kernel:0[FLOAT, 160x128x1x7]
  %scale74[FLOAT, 128]
  %bias74[FLOAT, 128]
  %mean74[FLOAT, 128]
  %var74[FLOAT, 128]
  %block17_11_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_11_conv/bias:0[FLOAT, 1088]
  %conv2d_219/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_222/kernel:0[FLOAT, 192x160x7x1]
  %scale75[FLOAT, 160]
  %bias75[FLOAT, 160]
  %mean75[FLOAT, 160]
  %var75[FLOAT, 160]
  %conv2d_232/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes20/block17_10/mul/y:0[FLOAT, scalar]
  %scale76[FLOAT, 192]
  %bias76[FLOAT, 192]
  %mean76[FLOAT, 192]
  %var76[FLOAT, 192]
  %scale77[FLOAT, 192]
  %bias77[FLOAT, 192]
  %mean77[FLOAT, 192]
  %var77[FLOAT, 192]
  %conv2d_225/kernel:0[FLOAT, 160x128x1x7]
  %scale78[FLOAT, 128]
  %bias78[FLOAT, 128]
  %mean78[FLOAT, 128]
  %var78[FLOAT, 128]
  %block17_10_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_10_conv/bias:0[FLOAT, 1088]
  %conv2d_215/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_218/kernel:0[FLOAT, 192x160x7x1]
  %scale79[FLOAT, 160]
  %bias79[FLOAT, 160]
  %mean79[FLOAT, 160]
  %var79[FLOAT, 160]
  %conv2d_228/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes21/block17_9/mul/y:0[FLOAT, scalar]
  %scale80[FLOAT, 192]
  %bias80[FLOAT, 192]
  %mean80[FLOAT, 192]
  %var80[FLOAT, 192]
  %scale81[FLOAT, 192]
  %bias81[FLOAT, 192]
  %mean81[FLOAT, 192]
  %var81[FLOAT, 192]
  %conv2d_221/kernel:0[FLOAT, 160x128x1x7]
  %scale82[FLOAT, 128]
  %bias82[FLOAT, 128]
  %mean82[FLOAT, 128]
  %var82[FLOAT, 128]
  %block17_9_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_9_conv/bias:0[FLOAT, 1088]
  %conv2d_211/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_214/kernel:0[FLOAT, 192x160x7x1]
  %scale83[FLOAT, 160]
  %bias83[FLOAT, 160]
  %mean83[FLOAT, 160]
  %var83[FLOAT, 160]
  %conv2d_224/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes22/block17_8/mul/y:0[FLOAT, scalar]
  %scale84[FLOAT, 192]
  %bias84[FLOAT, 192]
  %mean84[FLOAT, 192]
  %var84[FLOAT, 192]
  %scale85[FLOAT, 192]
  %bias85[FLOAT, 192]
  %mean85[FLOAT, 192]
  %var85[FLOAT, 192]
  %conv2d_217/kernel:0[FLOAT, 160x128x1x7]
  %scale86[FLOAT, 128]
  %bias86[FLOAT, 128]
  %mean86[FLOAT, 128]
  %var86[FLOAT, 128]
  %block17_8_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_8_conv/bias:0[FLOAT, 1088]
  %conv2d_207/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_210/kernel:0[FLOAT, 192x160x7x1]
  %scale87[FLOAT, 160]
  %bias87[FLOAT, 160]
  %mean87[FLOAT, 160]
  %var87[FLOAT, 160]
  %conv2d_220/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes23/block17_7/mul/y:0[FLOAT, scalar]
  %scale88[FLOAT, 192]
  %bias88[FLOAT, 192]
  %mean88[FLOAT, 192]
  %var88[FLOAT, 192]
  %scale89[FLOAT, 192]
  %bias89[FLOAT, 192]
  %mean89[FLOAT, 192]
  %var89[FLOAT, 192]
  %conv2d_213/kernel:0[FLOAT, 160x128x1x7]
  %scale90[FLOAT, 128]
  %bias90[FLOAT, 128]
  %mean90[FLOAT, 128]
  %var90[FLOAT, 128]
  %block17_7_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_7_conv/bias:0[FLOAT, 1088]
  %conv2d_203/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_206/kernel:0[FLOAT, 192x160x7x1]
  %scale91[FLOAT, 160]
  %bias91[FLOAT, 160]
  %mean91[FLOAT, 160]
  %var91[FLOAT, 160]
  %conv2d_216/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes24/block17_6/mul/y:0[FLOAT, scalar]
  %scale92[FLOAT, 192]
  %bias92[FLOAT, 192]
  %mean92[FLOAT, 192]
  %var92[FLOAT, 192]
  %scale93[FLOAT, 192]
  %bias93[FLOAT, 192]
  %mean93[FLOAT, 192]
  %var93[FLOAT, 192]
  %conv2d_209/kernel:0[FLOAT, 160x128x1x7]
  %scale94[FLOAT, 128]
  %bias94[FLOAT, 128]
  %mean94[FLOAT, 128]
  %var94[FLOAT, 128]
  %block17_6_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_6_conv/bias:0[FLOAT, 1088]
  %conv2d_199/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_202/kernel:0[FLOAT, 192x160x7x1]
  %scale95[FLOAT, 160]
  %bias95[FLOAT, 160]
  %mean95[FLOAT, 160]
  %var95[FLOAT, 160]
  %conv2d_212/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes25/block17_5/mul/y:0[FLOAT, scalar]
  %scale96[FLOAT, 192]
  %bias96[FLOAT, 192]
  %mean96[FLOAT, 192]
  %var96[FLOAT, 192]
  %scale97[FLOAT, 192]
  %bias97[FLOAT, 192]
  %mean97[FLOAT, 192]
  %var97[FLOAT, 192]
  %conv2d_205/kernel:0[FLOAT, 160x128x1x7]
  %scale98[FLOAT, 128]
  %bias98[FLOAT, 128]
  %mean98[FLOAT, 128]
  %var98[FLOAT, 128]
  %block17_5_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_5_conv/bias:0[FLOAT, 1088]
  %conv2d_195/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_198/kernel:0[FLOAT, 192x160x7x1]
  %scale99[FLOAT, 160]
  %bias99[FLOAT, 160]
  %mean99[FLOAT, 160]
  %var99[FLOAT, 160]
  %conv2d_208/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes26/block17_4/mul/y:0[FLOAT, scalar]
  %scale100[FLOAT, 192]
  %bias100[FLOAT, 192]
  %mean100[FLOAT, 192]
  %var100[FLOAT, 192]
  %scale101[FLOAT, 192]
  %bias101[FLOAT, 192]
  %mean101[FLOAT, 192]
  %var101[FLOAT, 192]
  %conv2d_201/kernel:0[FLOAT, 160x128x1x7]
  %scale102[FLOAT, 128]
  %bias102[FLOAT, 128]
  %mean102[FLOAT, 128]
  %var102[FLOAT, 128]
  %block17_4_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_4_conv/bias:0[FLOAT, 1088]
  %conv2d_191/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_194/kernel:0[FLOAT, 192x160x7x1]
  %scale103[FLOAT, 160]
  %bias103[FLOAT, 160]
  %mean103[FLOAT, 160]
  %var103[FLOAT, 160]
  %conv2d_204/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes27/block17_3/mul/y:0[FLOAT, scalar]
  %scale104[FLOAT, 192]
  %bias104[FLOAT, 192]
  %mean104[FLOAT, 192]
  %var104[FLOAT, 192]
  %scale105[FLOAT, 192]
  %bias105[FLOAT, 192]
  %mean105[FLOAT, 192]
  %var105[FLOAT, 192]
  %conv2d_197/kernel:0[FLOAT, 160x128x1x7]
  %scale106[FLOAT, 128]
  %bias106[FLOAT, 128]
  %mean106[FLOAT, 128]
  %var106[FLOAT, 128]
  %block17_3_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_3_conv/bias:0[FLOAT, 1088]
  %conv2d_187/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_190/kernel:0[FLOAT, 192x160x7x1]
  %scale107[FLOAT, 160]
  %bias107[FLOAT, 160]
  %mean107[FLOAT, 160]
  %var107[FLOAT, 160]
  %conv2d_200/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes28/block17_2/mul/y:0[FLOAT, scalar]
  %scale108[FLOAT, 192]
  %bias108[FLOAT, 192]
  %mean108[FLOAT, 192]
  %var108[FLOAT, 192]
  %scale109[FLOAT, 192]
  %bias109[FLOAT, 192]
  %mean109[FLOAT, 192]
  %var109[FLOAT, 192]
  %conv2d_193/kernel:0[FLOAT, 160x128x1x7]
  %scale110[FLOAT, 128]
  %bias110[FLOAT, 128]
  %mean110[FLOAT, 128]
  %var110[FLOAT, 128]
  %block17_2_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_2_conv/bias:0[FLOAT, 1088]
  %conv2d_183/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_186/kernel:0[FLOAT, 192x160x7x1]
  %scale111[FLOAT, 160]
  %bias111[FLOAT, 160]
  %mean111[FLOAT, 160]
  %var111[FLOAT, 160]
  %conv2d_196/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes29/block17_1/mul/y:0[FLOAT, scalar]
  %scale112[FLOAT, 192]
  %bias112[FLOAT, 192]
  %mean112[FLOAT, 192]
  %var112[FLOAT, 192]
  %scale113[FLOAT, 192]
  %bias113[FLOAT, 192]
  %mean113[FLOAT, 192]
  %var113[FLOAT, 192]
  %conv2d_189/kernel:0[FLOAT, 160x128x1x7]
  %scale114[FLOAT, 128]
  %bias114[FLOAT, 128]
  %mean114[FLOAT, 128]
  %var114[FLOAT, 128]
  %block17_1_conv/kernel:0[FLOAT, 1088x384x1x1]
  %block17_1_conv/bias:0[FLOAT, 1088]
  %conv2d_179/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_182/kernel:0[FLOAT, 192x160x7x1]
  %scale115[FLOAT, 160]
  %bias115[FLOAT, 160]
  %mean115[FLOAT, 160]
  %var115[FLOAT, 160]
  %conv2d_192/kernel:0[FLOAT, 128x1088x1x1]
  %scale116[FLOAT, 192]
  %bias116[FLOAT, 192]
  %mean116[FLOAT, 192]
  %var116[FLOAT, 192]
  %scale117[FLOAT, 192]
  %bias117[FLOAT, 192]
  %mean117[FLOAT, 192]
  %var117[FLOAT, 192]
  %conv2d_185/kernel:0[FLOAT, 160x128x1x7]
  %scale118[FLOAT, 128]
  %bias118[FLOAT, 128]
  %mean118[FLOAT, 128]
  %var118[FLOAT, 128]
  %scale119[FLOAT, 384]
  %bias119[FLOAT, 384]
  %mean119[FLOAT, 384]
  %var119[FLOAT, 384]
  %scale120[FLOAT, 384]
  %bias120[FLOAT, 384]
  %mean120[FLOAT, 384]
  %var120[FLOAT, 384]
  %conv2d_175/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_178/kernel:0[FLOAT, 192x160x7x1]
  %scale121[FLOAT, 160]
  %bias121[FLOAT, 160]
  %mean121[FLOAT, 160]
  %var121[FLOAT, 160]
  %conv2d_188/kernel:0[FLOAT, 128x1088x1x1]
  %conv2d_167/kernel:0[FLOAT, 384x320x3x3]
  %conv2d_170/kernel:0[FLOAT, 384x256x3x3]
  %TFNodes30/block35_10/mul/y:0[FLOAT, scalar]
  %scale122[FLOAT, 192]
  %bias122[FLOAT, 192]
  %mean122[FLOAT, 192]
  %var122[FLOAT, 192]
  %scale123[FLOAT, 192]
  %bias123[FLOAT, 192]
  %mean123[FLOAT, 192]
  %var123[FLOAT, 192]
  %conv2d_181/kernel:0[FLOAT, 160x128x1x7]
  %scale124[FLOAT, 128]
  %bias124[FLOAT, 128]
  %mean124[FLOAT, 128]
  %var124[FLOAT, 128]
  %block35_10_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_10_conv/bias:0[FLOAT, 320]
  %conv2d_171/kernel:0[FLOAT, 192x1088x1x1]
  %conv2d_174/kernel:0[FLOAT, 192x160x7x1]
  %scale125[FLOAT, 160]
  %bias125[FLOAT, 160]
  %mean125[FLOAT, 160]
  %var125[FLOAT, 160]
  %conv2d_184/kernel:0[FLOAT, 128x1088x1x1]
  %scale126[FLOAT, 256]
  %bias126[FLOAT, 256]
  %mean126[FLOAT, 256]
  %var126[FLOAT, 256]
  %TFNodes31/block35_9/mul/y:0[FLOAT, scalar]
  %conv2d_177/kernel:0[FLOAT, 160x128x1x7]
  %scale127[FLOAT, 128]
  %bias127[FLOAT, 128]
  %mean127[FLOAT, 128]
  %var127[FLOAT, 128]
  %conv2d_169/kernel:0[FLOAT, 256x256x3x3]
  %block35_9_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_9_conv/bias:0[FLOAT, 320]
  %scale128[FLOAT, 160]
  %bias128[FLOAT, 160]
  %mean128[FLOAT, 160]
  %var128[FLOAT, 160]
  %conv2d_180/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes32/block35_8/mul/y:0[FLOAT, scalar]
  %scale129[FLOAT, 32]
  %bias129[FLOAT, 32]
  %mean129[FLOAT, 32]
  %var129[FLOAT, 32]
  %scale130[FLOAT, 32]
  %bias130[FLOAT, 32]
  %mean130[FLOAT, 32]
  %var130[FLOAT, 32]
  %scale131[FLOAT, 64]
  %bias131[FLOAT, 64]
  %mean131[FLOAT, 64]
  %var131[FLOAT, 64]
  %conv2d_173/kernel:0[FLOAT, 160x128x1x7]
  %scale132[FLOAT, 128]
  %bias132[FLOAT, 128]
  %mean132[FLOAT, 128]
  %var132[FLOAT, 128]
  %scale133[FLOAT, 256]
  %bias133[FLOAT, 256]
  %mean133[FLOAT, 256]
  %var133[FLOAT, 256]
  %block35_8_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_8_conv/bias:0[FLOAT, 320]
  %conv2d_161/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_163/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_166/kernel:0[FLOAT, 64x48x3x3]
  %conv2d_176/kernel:0[FLOAT, 128x1088x1x1]
  %conv2d_168/kernel:0[FLOAT, 256x320x1x1]
  %TFNodes33/block35_7/mul/y:0[FLOAT, scalar]
  %scale134[FLOAT, 32]
  %bias134[FLOAT, 32]
  %mean134[FLOAT, 32]
  %var134[FLOAT, 32]
  %scale135[FLOAT, 32]
  %bias135[FLOAT, 32]
  %mean135[FLOAT, 32]
  %var135[FLOAT, 32]
  %scale136[FLOAT, 64]
  %bias136[FLOAT, 64]
  %mean136[FLOAT, 64]
  %var136[FLOAT, 64]
  %scale137[FLOAT, 128]
  %bias137[FLOAT, 128]
  %mean137[FLOAT, 128]
  %var137[FLOAT, 128]
  %block35_7_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_7_conv/bias:0[FLOAT, 320]
  %conv2d_155/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_157/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_160/kernel:0[FLOAT, 64x48x3x3]
  %scale138[FLOAT, 32]
  %bias138[FLOAT, 32]
  %mean138[FLOAT, 32]
  %var138[FLOAT, 32]
  %scale139[FLOAT, 48]
  %bias139[FLOAT, 48]
  %mean139[FLOAT, 48]
  %var139[FLOAT, 48]
  %conv2d_172/kernel:0[FLOAT, 128x1088x1x1]
  %TFNodes34/block35_6/mul/y:0[FLOAT, scalar]
  %scale140[FLOAT, 32]
  %bias140[FLOAT, 32]
  %mean140[FLOAT, 32]
  %var140[FLOAT, 32]
  %scale141[FLOAT, 32]
  %bias141[FLOAT, 32]
  %mean141[FLOAT, 32]
  %var141[FLOAT, 32]
  %scale142[FLOAT, 64]
  %bias142[FLOAT, 64]
  %mean142[FLOAT, 64]
  %var142[FLOAT, 64]
  %conv2d_162/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_165/kernel:0[FLOAT, 48x32x3x3]
  %block35_6_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_6_conv/bias:0[FLOAT, 320]
  %conv2d_149/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_151/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_154/kernel:0[FLOAT, 64x48x3x3]
  %scale143[FLOAT, 32]
  %bias143[FLOAT, 32]
  %mean143[FLOAT, 32]
  %var143[FLOAT, 32]
  %scale144[FLOAT, 48]
  %bias144[FLOAT, 48]
  %mean144[FLOAT, 48]
  %var144[FLOAT, 48]
  %TFNodes35/block35_5/mul/y:0[FLOAT, scalar]
  %scale145[FLOAT, 32]
  %bias145[FLOAT, 32]
  %mean145[FLOAT, 32]
  %var145[FLOAT, 32]
  %scale146[FLOAT, 32]
  %bias146[FLOAT, 32]
  %mean146[FLOAT, 32]
  %var146[FLOAT, 32]
  %scale147[FLOAT, 64]
  %bias147[FLOAT, 64]
  %mean147[FLOAT, 64]
  %var147[FLOAT, 64]
  %conv2d_156/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_159/kernel:0[FLOAT, 48x32x3x3]
  %scale148[FLOAT, 32]
  %bias148[FLOAT, 32]
  %mean148[FLOAT, 32]
  %var148[FLOAT, 32]
  %block35_5_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_5_conv/bias:0[FLOAT, 320]
  %conv2d_143/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_145/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_148/kernel:0[FLOAT, 64x48x3x3]
  %scale149[FLOAT, 32]
  %bias149[FLOAT, 32]
  %mean149[FLOAT, 32]
  %var149[FLOAT, 32]
  %scale150[FLOAT, 48]
  %bias150[FLOAT, 48]
  %mean150[FLOAT, 48]
  %var150[FLOAT, 48]
  %conv2d_164/kernel:0[FLOAT, 32x320x1x1]
  %TFNodes36/block35_4/mul/y:0[FLOAT, scalar]
  %scale151[FLOAT, 32]
  %bias151[FLOAT, 32]
  %mean151[FLOAT, 32]
  %var151[FLOAT, 32]
  %scale152[FLOAT, 32]
  %bias152[FLOAT, 32]
  %mean152[FLOAT, 32]
  %var152[FLOAT, 32]
  %scale153[FLOAT, 64]
  %bias153[FLOAT, 64]
  %mean153[FLOAT, 64]
  %var153[FLOAT, 64]
  %conv2d_150/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_153/kernel:0[FLOAT, 48x32x3x3]
  %scale154[FLOAT, 32]
  %bias154[FLOAT, 32]
  %mean154[FLOAT, 32]
  %var154[FLOAT, 32]
  %block35_4_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_4_conv/bias:0[FLOAT, 320]
  %conv2d_137/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_139/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_142/kernel:0[FLOAT, 64x48x3x3]
  %scale155[FLOAT, 32]
  %bias155[FLOAT, 32]
  %mean155[FLOAT, 32]
  %var155[FLOAT, 32]
  %scale156[FLOAT, 48]
  %bias156[FLOAT, 48]
  %mean156[FLOAT, 48]
  %var156[FLOAT, 48]
  %conv2d_158/kernel:0[FLOAT, 32x320x1x1]
  %TFNodes37/block35_3/mul/y:0[FLOAT, scalar]
  %scale157[FLOAT, 32]
  %bias157[FLOAT, 32]
  %mean157[FLOAT, 32]
  %var157[FLOAT, 32]
  %scale158[FLOAT, 32]
  %bias158[FLOAT, 32]
  %mean158[FLOAT, 32]
  %var158[FLOAT, 32]
  %scale159[FLOAT, 64]
  %bias159[FLOAT, 64]
  %mean159[FLOAT, 64]
  %var159[FLOAT, 64]
  %conv2d_144/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_147/kernel:0[FLOAT, 48x32x3x3]
  %scale160[FLOAT, 32]
  %bias160[FLOAT, 32]
  %mean160[FLOAT, 32]
  %var160[FLOAT, 32]
  %block35_3_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_3_conv/bias:0[FLOAT, 320]
  %conv2d_131/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_133/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_136/kernel:0[FLOAT, 64x48x3x3]
  %scale161[FLOAT, 32]
  %bias161[FLOAT, 32]
  %mean161[FLOAT, 32]
  %var161[FLOAT, 32]
  %scale162[FLOAT, 48]
  %bias162[FLOAT, 48]
  %mean162[FLOAT, 48]
  %var162[FLOAT, 48]
  %conv2d_152/kernel:0[FLOAT, 32x320x1x1]
  %TFNodes38/block35_2/mul/y:0[FLOAT, scalar]
  %scale163[FLOAT, 32]
  %bias163[FLOAT, 32]
  %mean163[FLOAT, 32]
  %var163[FLOAT, 32]
  %scale164[FLOAT, 32]
  %bias164[FLOAT, 32]
  %mean164[FLOAT, 32]
  %var164[FLOAT, 32]
  %scale165[FLOAT, 64]
  %bias165[FLOAT, 64]
  %mean165[FLOAT, 64]
  %var165[FLOAT, 64]
  %conv2d_138/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_141/kernel:0[FLOAT, 48x32x3x3]
  %scale166[FLOAT, 32]
  %bias166[FLOAT, 32]
  %mean166[FLOAT, 32]
  %var166[FLOAT, 32]
  %block35_2_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_2_conv/bias:0[FLOAT, 320]
  %conv2d_125/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_127/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_130/kernel:0[FLOAT, 64x48x3x3]
  %scale167[FLOAT, 32]
  %bias167[FLOAT, 32]
  %mean167[FLOAT, 32]
  %var167[FLOAT, 32]
  %scale168[FLOAT, 48]
  %bias168[FLOAT, 48]
  %mean168[FLOAT, 48]
  %var168[FLOAT, 48]
  %conv2d_146/kernel:0[FLOAT, 32x320x1x1]
  %TFNodes39/block35_1/mul/y:0[FLOAT, scalar]
  %scale169[FLOAT, 32]
  %bias169[FLOAT, 32]
  %mean169[FLOAT, 32]
  %var169[FLOAT, 32]
  %scale170[FLOAT, 32]
  %bias170[FLOAT, 32]
  %mean170[FLOAT, 32]
  %var170[FLOAT, 32]
  %scale171[FLOAT, 64]
  %bias171[FLOAT, 64]
  %mean171[FLOAT, 64]
  %var171[FLOAT, 64]
  %conv2d_132/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_135/kernel:0[FLOAT, 48x32x3x3]
  %scale172[FLOAT, 32]
  %bias172[FLOAT, 32]
  %mean172[FLOAT, 32]
  %var172[FLOAT, 32]
  %block35_1_conv/kernel:0[FLOAT, 320x128x1x1]
  %block35_1_conv/bias:0[FLOAT, 320]
  %conv2d_119/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_121/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_124/kernel:0[FLOAT, 64x48x3x3]
  %scale173[FLOAT, 32]
  %bias173[FLOAT, 32]
  %mean173[FLOAT, 32]
  %var173[FLOAT, 32]
  %scale174[FLOAT, 48]
  %bias174[FLOAT, 48]
  %mean174[FLOAT, 48]
  %var174[FLOAT, 48]
  %conv2d_140/kernel:0[FLOAT, 32x320x1x1]
  %scale175[FLOAT, 32]
  %bias175[FLOAT, 32]
  %mean175[FLOAT, 32]
  %var175[FLOAT, 32]
  %scale176[FLOAT, 32]
  %bias176[FLOAT, 32]
  %mean176[FLOAT, 32]
  %var176[FLOAT, 32]
  %scale177[FLOAT, 64]
  %bias177[FLOAT, 64]
  %mean177[FLOAT, 64]
  %var177[FLOAT, 64]
  %conv2d_126/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_129/kernel:0[FLOAT, 48x32x3x3]
  %scale178[FLOAT, 32]
  %bias178[FLOAT, 32]
  %mean178[FLOAT, 32]
  %var178[FLOAT, 32]
  %scale179[FLOAT, 96]
  %bias179[FLOAT, 96]
  %mean179[FLOAT, 96]
  %var179[FLOAT, 96]
  %scale180[FLOAT, 64]
  %bias180[FLOAT, 64]
  %mean180[FLOAT, 64]
  %var180[FLOAT, 64]
  %scale181[FLOAT, 96]
  %bias181[FLOAT, 96]
  %mean181[FLOAT, 96]
  %var181[FLOAT, 96]
  %scale182[FLOAT, 64]
  %bias182[FLOAT, 64]
  %mean182[FLOAT, 64]
  %var182[FLOAT, 64]
  %conv2d_113/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_115/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_118/kernel:0[FLOAT, 64x48x3x3]
  %scale183[FLOAT, 32]
  %bias183[FLOAT, 32]
  %mean183[FLOAT, 32]
  %var183[FLOAT, 32]
  %scale184[FLOAT, 48]
  %bias184[FLOAT, 48]
  %mean184[FLOAT, 48]
  %var184[FLOAT, 48]
  %conv2d_134/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_100/kernel:0[FLOAT, 96x192x1x1]
  %conv2d_102/kernel:0[FLOAT, 64x48x5x5]
  %conv2d_105/kernel:0[FLOAT, 96x96x3x3]
  %conv2d_106/kernel:0[FLOAT, 64x192x1x1]
  %scale185[FLOAT, 32]
  %bias185[FLOAT, 32]
  %mean185[FLOAT, 32]
  %var185[FLOAT, 32]
  %scale186[FLOAT, 32]
  %bias186[FLOAT, 32]
  %mean186[FLOAT, 32]
  %var186[FLOAT, 32]
  %scale187[FLOAT, 64]
  %bias187[FLOAT, 64]
  %mean187[FLOAT, 64]
  %var187[FLOAT, 64]
  %conv2d_120/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_123/kernel:0[FLOAT, 48x32x3x3]
  %scale188[FLOAT, 32]
  %bias188[FLOAT, 32]
  %mean188[FLOAT, 32]
  %var188[FLOAT, 32]
  %conv2d_107/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_109/kernel:0[FLOAT, 32x32x3x3]
  %conv2d_112/kernel:0[FLOAT, 64x48x3x3]
  %scale189[FLOAT, 32]
  %bias189[FLOAT, 32]
  %mean189[FLOAT, 32]
  %var189[FLOAT, 32]
  %scale190[FLOAT, 48]
  %bias190[FLOAT, 48]
  %mean190[FLOAT, 48]
  %var190[FLOAT, 48]
  %conv2d_128/kernel:0[FLOAT, 32x320x1x1]
  %scale191[FLOAT, 48]
  %bias191[FLOAT, 48]
  %mean191[FLOAT, 48]
  %var191[FLOAT, 48]
  %scale192[FLOAT, 96]
  %bias192[FLOAT, 96]
  %mean192[FLOAT, 96]
  %var192[FLOAT, 96]
  %conv2d_114/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_117/kernel:0[FLOAT, 48x32x3x3]
  %scale193[FLOAT, 32]
  %bias193[FLOAT, 32]
  %mean193[FLOAT, 32]
  %var193[FLOAT, 32]
  %scale194[FLOAT, 192]
  %bias194[FLOAT, 192]
  %mean194[FLOAT, 192]
  %var194[FLOAT, 192]
  %conv2d_101/kernel:0[FLOAT, 48x192x1x1]
  %conv2d_104/kernel:0[FLOAT, 96x64x3x3]
  %scale195[FLOAT, 32]
  %bias195[FLOAT, 32]
  %mean195[FLOAT, 32]
  %var195[FLOAT, 32]
  %scale196[FLOAT, 48]
  %bias196[FLOAT, 48]
  %mean196[FLOAT, 48]
  %var196[FLOAT, 48]
  %conv2d_122/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_99/kernel:0[FLOAT, 192x80x3x3]
  %conv2d_108/kernel:0[FLOAT, 32x320x1x1]
  %conv2d_111/kernel:0[FLOAT, 48x32x3x3]
  %scale197[FLOAT, 32]
  %bias197[FLOAT, 32]
  %mean197[FLOAT, 32]
  %var197[FLOAT, 32]
  %scale198[FLOAT, 64]
  %bias198[FLOAT, 64]
  %mean198[FLOAT, 64]
  %var198[FLOAT, 64]
  %conv2d_116/kernel:0[FLOAT, 32x320x1x1]
  %scale199[FLOAT, 80]
  %bias199[FLOAT, 80]
  %mean199[FLOAT, 80]
  %var199[FLOAT, 80]
  %conv2d_103/kernel:0[FLOAT, 64x192x1x1]
  %scale200[FLOAT, 32]
  %bias200[FLOAT, 32]
  %mean200[FLOAT, 32]
  %var200[FLOAT, 32]
  %conv2d_98/kernel:0[FLOAT, 80x64x1x1]
  %conv2d_110/kernel:0[FLOAT, 32x320x1x1]
  %scale201[FLOAT, 64]
  %bias201[FLOAT, 64]
  %mean201[FLOAT, 64]
  %var201[FLOAT, 64]
  %conv2d_97/kernel:0[FLOAT, 64x32x3x3]
  %scale202[FLOAT, 32]
  %bias202[FLOAT, 32]
  %mean202[FLOAT, 32]
  %var202[FLOAT, 32]
  %conv2d_96/kernel:0[FLOAT, 32x32x3x3]
  %scale203[FLOAT, 32]
  %bias203[FLOAT, 32]
  %mean203[FLOAT, 32]
  %var203[FLOAT, 32]
  %conv2d_95/kernel:0[FLOAT, 32x3x3x3]
) {
  %adjusted_input243 = Transpose[perm = [0, 3, 1, 2]](%input_2)
  %convolution_output243 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [2, 2]](%adjusted_input243, %conv2d_95/kernel:0)
  %batch_norm_output_buffer203 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output243, %scale203, %bias203, %mean203, %var203)
  %activation_95/Relu:0 = Relu(%batch_norm_output_buffer203)
  %convolution_output242 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%activation_95/Relu:0, %conv2d_96/kernel:0)
  %batch_norm_output_buffer202 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output242, %scale202, %bias202, %mean202, %var202)
  %activation_96/Relu:0 = Relu(%batch_norm_output_buffer202)
  %convolution_output241 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_96/Relu:0, %conv2d_97/kernel:0)
  %batch_norm_output_buffer201 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output241, %scale201, %bias201, %mean201, %var201)
  %activation_97/Relu:0 = Relu(%batch_norm_output_buffer201)
  %activation_97/Relu:0_pooling0 = MaxPool[auto_pad = 'VALID', ceil_mode = 0, kernel_shape = [3, 3], strides = [2, 2]](%activation_97/Relu:0)
  %convolution_output239 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%activation_97/Relu:0_pooling0, %conv2d_98/kernel:0)
  %batch_norm_output_buffer199 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output239, %scale199, %bias199, %mean199, %var199)
  %activation_98/Relu:0 = Relu(%batch_norm_output_buffer199)
  %convolution_output234 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%activation_98/Relu:0, %conv2d_99/kernel:0)
  %batch_norm_output_buffer194 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output234, %scale194, %bias194, %mean194, %var194)
  %activation_99/Relu:0 = Relu(%batch_norm_output_buffer194)
  %activation_99/Relu:0_pooling0 = MaxPool[auto_pad = 'VALID', ceil_mode = 0, kernel_shape = [3, 3], strides = [2, 2]](%activation_99/Relu:0)
  %max_pooling2d_6/MaxPool:0 = Identity(%activation_99/Relu:0_pooling0)
  %convolution_output238 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%max_pooling2d_6/MaxPool:0, %conv2d_103/kernel:0)
  %batch_norm_output_buffer198 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output238, %scale198, %bias198, %mean198, %var198)
  %activation_103/Relu:0 = Relu(%batch_norm_output_buffer198)
  %convolution_output232 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_103/Relu:0, %conv2d_104/kernel:0)
  %batch_norm_output_buffer192 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output232, %scale192, %bias192, %mean192, %var192)
  %activation_104/Relu:0 = Relu(%batch_norm_output_buffer192)
  %convolution_output231 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%max_pooling2d_6/MaxPool:0, %conv2d_101/kernel:0)
  %batch_norm_output_buffer191 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output231, %scale191, %bias191, %mean191, %var191)
  %activation_101/Relu:0 = Relu(%batch_norm_output_buffer191)
  %max_pooling2d_6/MaxPool:0_pooling0 = AveragePool[auto_pad = 'SAME_UPPER', ceil_mode = 0, kernel_shape = [3, 3], strides = [1, 1]](%max_pooling2d_6/MaxPool:0)
  %convolution_output222 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%max_pooling2d_6/MaxPool:0_pooling0, %conv2d_106/kernel:0)
  %convolution_output221 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_104/Relu:0, %conv2d_105/kernel:0)
  %convolution_output220 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [5, 5], pads = [2, 2, 2, 2], strides = [1, 1]](%activation_101/Relu:0, %conv2d_102/kernel:0)
  %convolution_output219 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%max_pooling2d_6/MaxPool:0, %conv2d_100/kernel:0)
  %batch_norm_output_buffer182 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output222, %scale182, %bias182, %mean182, %var182)
  %batch_norm_output_buffer181 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output221, %scale181, %bias181, %mean181, %var181)
  %batch_norm_output_buffer180 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output220, %scale180, %bias180, %mean180, %var180)
  %batch_norm_output_buffer179 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output219, %scale179, %bias179, %mean179, %var179)
  %activation_106/Relu:0 = Relu(%batch_norm_output_buffer182)
  %activation_105/Relu:0 = Relu(%batch_norm_output_buffer181)
  %activation_102/Relu:0 = Relu(%batch_norm_output_buffer180)
  %activation_100/Relu:0 = Relu(%batch_norm_output_buffer179)
  %mixed_5b/concat:0 = Concat[axis = 1](%activation_100/Relu:0, %activation_102/Relu:0, %activation_105/Relu:0, %activation_106/Relu:0)
  %convolution_output240 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%mixed_5b/concat:0, %conv2d_110/kernel:0)
  %batch_norm_output_buffer200 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output240, %scale200, %bias200, %mean200, %var200)
  %activation_110/Relu:0 = Relu(%batch_norm_output_buffer200)
  %convolution_output236 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_110/Relu:0, %conv2d_111/kernel:0)
  %batch_norm_output_buffer196 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output236, %scale196, %bias196, %mean196, %var196)
  %activation_111/Relu:0 = Relu(%batch_norm_output_buffer196)
  %convolution_output227 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_111/Relu:0, %conv2d_112/kernel:0)
  %batch_norm_output_buffer187 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output227, %scale187, %bias187, %mean187, %var187)
  %activation_112/Relu:0 = Relu(%batch_norm_output_buffer187)
  %convolution_output235 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%mixed_5b/concat:0, %conv2d_108/kernel:0)
  %batch_norm_output_buffer195 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output235, %scale195, %bias195, %mean195, %var195)
  %activation_108/Relu:0 = Relu(%batch_norm_output_buffer195)
  %convolution_output226 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_108/Relu:0, %conv2d_109/kernel:0)
  %batch_norm_output_buffer186 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output226, %scale186, %bias186, %mean186, %var186)
  %activation_109/Relu:0 = Relu(%batch_norm_output_buffer186)
  %convolution_output225 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%mixed_5b/concat:0, %conv2d_107/kernel:0)
  %batch_norm_output_buffer185 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output225, %scale185, %bias185, %mean185, %var185)
  %activation_107/Relu:0 = Relu(%batch_norm_output_buffer185)
  %block35_1_mixed/concat:0 = Concat[axis = 1](%activation_107/Relu:0, %activation_109/Relu:0, %activation_112/Relu:0)
  %convolution_output208 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%block35_1_mixed/concat:0, %block35_1_conv/kernel:0, %block35_1_conv/bias:0)
  %transpose_output208 = Transpose[perm = [0, 2, 3, 1]](%convolution_output208)
  %fan_out_adjustment_out100 = Transpose[perm = [0, 2, 3, 1]](%mixed_5b/concat:0)
  %TFNodes39/block35_1/mul:0 = Mul(%transpose_output208, %TFNodes39/block35_1/mul/y:0)
  %TFNodes39/block35_1/add:0 = Add(%fan_out_adjustment_out100, %TFNodes39/block35_1/mul:0)
  %block35_1_ac/Relu:0 = Relu(%TFNodes39/block35_1/add:0)
  %adjusted_input237 = Transpose[perm = [0, 3, 1, 2]](%block35_1_ac/Relu:0)
  %convolution_output237 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input237, %conv2d_116/kernel:0)
  %batch_norm_output_buffer197 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output237, %scale197, %bias197, %mean197, %var197)
  %activation_116/Relu:0 = Relu(%batch_norm_output_buffer197)
  %convolution_output230 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_116/Relu:0, %conv2d_117/kernel:0)
  %batch_norm_output_buffer190 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output230, %scale190, %bias190, %mean190, %var190)
  %activation_117/Relu:0 = Relu(%batch_norm_output_buffer190)
  %convolution_output217 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_117/Relu:0, %conv2d_118/kernel:0)
  %batch_norm_output_buffer177 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output217, %scale177, %bias177, %mean177, %var177)
  %activation_118/Relu:0 = Relu(%batch_norm_output_buffer177)
  %adjusted_input229 = Transpose[perm = [0, 3, 1, 2]](%block35_1_ac/Relu:0)
  %convolution_output229 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input229, %conv2d_114/kernel:0)
  %batch_norm_output_buffer189 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output229, %scale189, %bias189, %mean189, %var189)
  %activation_114/Relu:0 = Relu(%batch_norm_output_buffer189)
  %convolution_output216 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_114/Relu:0, %conv2d_115/kernel:0)
  %batch_norm_output_buffer176 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output216, %scale176, %bias176, %mean176, %var176)
  %activation_115/Relu:0 = Relu(%batch_norm_output_buffer176)
  %adjusted_input215 = Transpose[perm = [0, 3, 1, 2]](%block35_1_ac/Relu:0)
  %convolution_output215 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input215, %conv2d_113/kernel:0)
  %batch_norm_output_buffer175 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output215, %scale175, %bias175, %mean175, %var175)
  %activation_113/Relu:0 = Relu(%batch_norm_output_buffer175)
  %block35_2_mixed/concat:0 = Concat[axis = 1](%activation_113/Relu:0, %activation_115/Relu:0, %activation_118/Relu:0)
  %convolution_output201 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%block35_2_mixed/concat:0, %block35_2_conv/kernel:0, %block35_2_conv/bias:0)
  %transpose_output201 = Transpose[perm = [0, 2, 3, 1]](%convolution_output201)
  %TFNodes38/block35_2/mul:0 = Mul(%transpose_output201, %TFNodes38/block35_2/mul/y:0)
  %TFNodes38/block35_2/add:0 = Add(%block35_1_ac/Relu:0, %TFNodes38/block35_2/mul:0)
  %block35_2_ac/Relu:0 = Relu(%TFNodes38/block35_2/add:0)
  %adjusted_input233 = Transpose[perm = [0, 3, 1, 2]](%block35_2_ac/Relu:0)
  %convolution_output233 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input233, %conv2d_122/kernel:0)
  %batch_norm_output_buffer193 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output233, %scale193, %bias193, %mean193, %var193)
  %activation_122/Relu:0 = Relu(%batch_norm_output_buffer193)
  %convolution_output224 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_122/Relu:0, %conv2d_123/kernel:0)
  %batch_norm_output_buffer184 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output224, %scale184, %bias184, %mean184, %var184)
  %activation_123/Relu:0 = Relu(%batch_norm_output_buffer184)
  %convolution_output211 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_123/Relu:0, %conv2d_124/kernel:0)
  %batch_norm_output_buffer171 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output211, %scale171, %bias171, %mean171, %var171)
  %activation_124/Relu:0 = Relu(%batch_norm_output_buffer171)
  %adjusted_input223 = Transpose[perm = [0, 3, 1, 2]](%block35_2_ac/Relu:0)
  %convolution_output223 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input223, %conv2d_120/kernel:0)
  %batch_norm_output_buffer183 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output223, %scale183, %bias183, %mean183, %var183)
  %activation_120/Relu:0 = Relu(%batch_norm_output_buffer183)
  %convolution_output210 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_120/Relu:0, %conv2d_121/kernel:0)
  %batch_norm_output_buffer170 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output210, %scale170, %bias170, %mean170, %var170)
  %activation_121/Relu:0 = Relu(%batch_norm_output_buffer170)
  %adjusted_input209 = Transpose[perm = [0, 3, 1, 2]](%block35_2_ac/Relu:0)
  %convolution_output209 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input209, %conv2d_119/kernel:0)
  %batch_norm_output_buffer169 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output209, %scale169, %bias169, %mean169, %var169)
  %activation_119/Relu:0 = Relu(%batch_norm_output_buffer169)
  %block35_3_mixed/concat:0 = Concat[axis = 1](%activation_119/Relu:0, %activation_121/Relu:0, %activation_124/Relu:0)
  %convolution_output194 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%block35_3_mixed/concat:0, %block35_3_conv/kernel:0, %block35_3_conv/bias:0)
  %transpose_output194 = Transpose[perm = [0, 2, 3, 1]](%convolution_output194)
  %TFNodes37/block35_3/mul:0 = Mul(%transpose_output194, %TFNodes37/block35_3/mul/y:0)
  %TFNodes37/block35_3/add:0 = Add(%block35_2_ac/Relu:0, %TFNodes37/block35_3/mul:0)
  %block35_3_ac/Relu:0 = Relu(%TFNodes37/block35_3/add:0)
  %adjusted_input228 = Transpose[perm = [0, 3, 1, 2]](%block35_3_ac/Relu:0)
  %convolution_output228 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input228, %conv2d_128/kernel:0)
  %batch_norm_output_buffer188 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output228, %scale188, %bias188, %mean188, %var188)
  %activation_128/Relu:0 = Relu(%batch_norm_output_buffer188)
  %convolution_output214 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_128/Relu:0, %conv2d_129/kernel:0)
  %batch_norm_output_buffer174 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output214, %scale174, %bias174, %mean174, %var174)
  %activation_129/Relu:0 = Relu(%batch_norm_output_buffer174)
  %convolution_output204 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%activation_129/Relu:0, %conv2d_130/kernel:0)
  %batch_norm_output_buffer165 = BatchNormalization[epsilon = 9.99999997475243e-07, momentum = 0.990000009536743](%convolution_output204, %scale165, %bias165, %mean165, %var165)
  %activation_130/Relu:0 = Relu(%batch_norm_output_buffer165)
  %adjusted_input213 = Transpose[perm = [0, 3, 1, 2]](%block35_3_ac/Relu:0)
  %convolution_output213 = Conv[auto_pad = 'NOTSET', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%adjusted_input213, %conv2d_126/kernel:0)
