graph nasnet_mobile (
  %input_15[FLOAT, Nx224x224x3]
) initializers (
  %predictions_1/kernel:0[FLOAT, 1056x1000]
  %predictions_1/bias:0[FLOAT, 1000]
  %activation_376/Relu:0_reshape_start[INT64, 2]
  %scale[FLOAT, 176]
  %bias[FLOAT, 176]
  %mean[FLOAT, 176]
  %var[FLOAT, 176]
  %normal_A_block_12_1/adjust_block/adjust_projection_block_12/adjust_conv_projection_12/kernel:0[FLOAT, 176x1056x1x1]
  %scale1[FLOAT, 176]
  %bias1[FLOAT, 176]
  %mean1[FLOAT, 176]
  %var1[FLOAT, 176]
  %scale2[FLOAT, 176]
  %bias2[FLOAT, 176]
  %mean2[FLOAT, 176]
  %var2[FLOAT, 176]
  %scale3[FLOAT, 176]
  %bias3[FLOAT, 176]
  %mean3[FLOAT, 176]
  %var3[FLOAT, 176]
  %scale4[FLOAT, 176]
  %bias4[FLOAT, 176]
  %mean4[FLOAT, 176]
  %var4[FLOAT, 176]
  %scale5[FLOAT, 176]
  %bias5[FLOAT, 176]
  %mean5[FLOAT, 176]
  %var5[FLOAT, 176]
  %scale6[FLOAT, 176]
  %bias6[FLOAT, 176]
  %mean6[FLOAT, 176]
  %var6[FLOAT, 176]
  %normal_A_block_12_1/block_1/separable_conv_block_normal_left1_12/separable_conv_2_normal_left1_12/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_1/separable_conv_block_normal_right1_12/separable_conv_2_normal_right1_12/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W1[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_2/separable_conv_block_normal_left2_12/separable_conv_2_normal_left2_12/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W2[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_2/separable_conv_block_normal_right2_12/separable_conv_2_normal_right2_12/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W3[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_5/separable_conv_block_normal_left5_12/separable_conv_2_normal_left5_12/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W4[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/normal_conv_1_12/kernel:0[FLOAT, 176x1056x1x1]
  %scale7[FLOAT, 176]
  %bias7[FLOAT, 176]
  %mean7[FLOAT, 176]
  %var7[FLOAT, 176]
  %scale8[FLOAT, 176]
  %bias8[FLOAT, 176]
  %mean8[FLOAT, 176]
  %var8[FLOAT, 176]
  %scale9[FLOAT, 176]
  %bias9[FLOAT, 176]
  %mean9[FLOAT, 176]
  %var9[FLOAT, 176]
  %scale10[FLOAT, 176]
  %bias10[FLOAT, 176]
  %mean10[FLOAT, 176]
  %var10[FLOAT, 176]
  %scale11[FLOAT, 176]
  %bias11[FLOAT, 176]
  %mean11[FLOAT, 176]
  %var11[FLOAT, 176]
  %scale12[FLOAT, 176]
  %bias12[FLOAT, 176]
  %mean12[FLOAT, 176]
  %var12[FLOAT, 176]
  %normal_A_block_10_1/adjust_block/adjust_projection_block_10/adjust_conv_projection_10/kernel:0[FLOAT, 176x704x1x1]
  %scale13[FLOAT, 176]
  %bias13[FLOAT, 176]
  %mean13[FLOAT, 176]
  %var13[FLOAT, 176]
  %scale14[FLOAT, 176]
  %bias14[FLOAT, 176]
  %mean14[FLOAT, 176]
  %var14[FLOAT, 176]
  %scale15[FLOAT, 176]
  %bias15[FLOAT, 176]
  %mean15[FLOAT, 176]
  %var15[FLOAT, 176]
  %scale16[FLOAT, 176]
  %bias16[FLOAT, 176]
  %mean16[FLOAT, 176]
  %var16[FLOAT, 176]
  %scale17[FLOAT, 176]
  %bias17[FLOAT, 176]
  %mean17[FLOAT, 176]
  %var17[FLOAT, 176]
  %scale18[FLOAT, 176]
  %bias18[FLOAT, 176]
  %mean18[FLOAT, 176]
  %var18[FLOAT, 176]
  %normal_A_block_12_1/block_1/separable_conv_block_normal_left1_12/separable_conv_1_normal_left1_12/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W5[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_1/separable_conv_block_normal_right1_12/separable_conv_1_normal_right1_12/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W6[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_2/separable_conv_block_normal_left2_12/separable_conv_1_normal_left2_12/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W7[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_2/separable_conv_block_normal_right2_12/separable_conv_1_normal_right2_12/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W8[FLOAT, 176x176x1x1]
  %normal_A_block_12_1/block_5/separable_conv_block_normal_left5_12/separable_conv_1_normal_left5_12/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W9[FLOAT, 176x176x1x1]
  %scale19[FLOAT, 176]
  %bias19[FLOAT, 176]
  %mean19[FLOAT, 176]
  %var19[FLOAT, 176]
  %normal_A_block_10_1/block_1/separable_conv_block_normal_left1_10/separable_conv_2_normal_left1_10/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W10[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_1/separable_conv_block_normal_right1_10/separable_conv_2_normal_right1_10/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W11[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_2/separable_conv_block_normal_left2_10/separable_conv_2_normal_left2_10/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W12[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_2/separable_conv_block_normal_right2_10/separable_conv_2_normal_right2_10/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W13[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_5/separable_conv_block_normal_left5_10/separable_conv_2_normal_left5_10/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W14[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/normal_conv_1_10/kernel:0[FLOAT, 176x1056x1x1]
  %normal_A_block_11_1/adjust_block/adjust_projection_block_11/adjust_conv_projection_11/kernel:0[FLOAT, 176x1056x1x1]
  %scale20[FLOAT, 176]
  %bias20[FLOAT, 176]
  %mean20[FLOAT, 176]
  %var20[FLOAT, 176]
  %scale21[FLOAT, 176]
  %bias21[FLOAT, 176]
  %mean21[FLOAT, 176]
  %var21[FLOAT, 176]
  %scale22[FLOAT, 176]
  %bias22[FLOAT, 176]
  %mean22[FLOAT, 176]
  %var22[FLOAT, 176]
  %scale23[FLOAT, 176]
  %bias23[FLOAT, 176]
  %mean23[FLOAT, 176]
  %var23[FLOAT, 176]
  %scale24[FLOAT, 176]
  %bias24[FLOAT, 176]
  %mean24[FLOAT, 176]
  %var24[FLOAT, 176]
  %scale25[FLOAT, 176]
  %bias25[FLOAT, 176]
  %mean25[FLOAT, 176]
  %var25[FLOAT, 176]
  %normal_A_block_11_1/block_1/separable_conv_block_normal_left1_11/separable_conv_2_normal_left1_11/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W15[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_1/separable_conv_block_normal_right1_11/separable_conv_2_normal_right1_11/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W16[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_2/separable_conv_block_normal_left2_11/separable_conv_2_normal_left2_11/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W17[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_2/separable_conv_block_normal_right2_11/separable_conv_2_normal_right2_11/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W18[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_5/separable_conv_block_normal_left5_11/separable_conv_2_normal_left5_11/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W19[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/normal_conv_1_11/kernel:0[FLOAT, 176x1056x1x1]
  %scale26[FLOAT, 176]
  %bias26[FLOAT, 176]
  %mean26[FLOAT, 176]
  %var26[FLOAT, 176]
  %scale27[FLOAT, 176]
  %bias27[FLOAT, 176]
  %mean27[FLOAT, 176]
  %var27[FLOAT, 176]
  %scale28[FLOAT, 176]
  %bias28[FLOAT, 176]
  %mean28[FLOAT, 176]
  %var28[FLOAT, 176]
  %scale29[FLOAT, 176]
  %bias29[FLOAT, 176]
  %mean29[FLOAT, 176]
  %var29[FLOAT, 176]
  %scale30[FLOAT, 176]
  %bias30[FLOAT, 176]
  %mean30[FLOAT, 176]
  %var30[FLOAT, 176]
  %scale31[FLOAT, 176]
  %bias31[FLOAT, 176]
  %mean31[FLOAT, 176]
  %var31[FLOAT, 176]
  %scale32[FLOAT, 176]
  %bias32[FLOAT, 176]
  %mean32[FLOAT, 176]
  %var32[FLOAT, 176]
  %scale33[FLOAT, 176]
  %bias33[FLOAT, 176]
  %mean33[FLOAT, 176]
  %var33[FLOAT, 176]
  %normal_A_block_10_1/block_1/separable_conv_block_normal_left1_10/separable_conv_1_normal_left1_10/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W20[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_1/separable_conv_block_normal_right1_10/separable_conv_1_normal_right1_10/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W21[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_2/separable_conv_block_normal_left2_10/separable_conv_1_normal_left2_10/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W22[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_2/separable_conv_block_normal_right2_10/separable_conv_1_normal_right2_10/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W23[FLOAT, 176x176x1x1]
  %normal_A_block_10_1/block_5/separable_conv_block_normal_left5_10/separable_conv_1_normal_left5_10/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W24[FLOAT, 176x176x1x1]
  %scale34[FLOAT, 176]
  %bias34[FLOAT, 176]
  %mean34[FLOAT, 176]
  %var34[FLOAT, 176]
  %scale35[FLOAT, 176]
  %bias35[FLOAT, 176]
  %mean35[FLOAT, 176]
  %var35[FLOAT, 176]
  %scale36[FLOAT, 176]
  %bias36[FLOAT, 176]
  %mean36[FLOAT, 176]
  %var36[FLOAT, 176]
  %scale37[FLOAT, 176]
  %bias37[FLOAT, 176]
  %mean37[FLOAT, 176]
  %var37[FLOAT, 176]
  %scale38[FLOAT, 176]
  %bias38[FLOAT, 176]
  %mean38[FLOAT, 176]
  %var38[FLOAT, 176]
  %scale39[FLOAT, 176]
  %bias39[FLOAT, 176]
  %mean39[FLOAT, 176]
  %var39[FLOAT, 176]
  %Pad_pads[INT64, 8]
  %Pad_value[FLOAT, scalar]
  %reduction_A_block_reduce_8_1/block_2/separable_conv_block_reduction_right2_reduce_8/separable_conv_2_reduction_right2_reduce_8/depthwise_kernel:0[FLOAT, 176x1x7x7]
  %W25[FLOAT, 176x176x1x1]
  %reduction_A_block_reduce_8_1/block_3/separable_conv_block_reduction_right3_reduce_8/separable_conv_2_reduction_right3_reduce_8/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W26[FLOAT, 176x176x1x1]
  %reduction_A_block_reduce_8_1/block_5/separable_conv_block_reduction_left4_reduce_8/separable_conv_2_reduction_left4_reduce_8/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W27[FLOAT, 176x176x1x1]
  %scale40[FLOAT, 176]
  %bias40[FLOAT, 176]
  %mean40[FLOAT, 176]
  %var40[FLOAT, 176]
  %scale41[FLOAT, 176]
  %bias41[FLOAT, 176]
  %mean41[FLOAT, 176]
  %var41[FLOAT, 176]
  %scale42[FLOAT, 176]
  %bias42[FLOAT, 176]
  %mean42[FLOAT, 176]
  %var42[FLOAT, 176]
  %scale43[FLOAT, 176]
  %bias43[FLOAT, 176]
  %mean43[FLOAT, 176]
  %var43[FLOAT, 176]
  %scale44[FLOAT, 176]
  %bias44[FLOAT, 176]
  %mean44[FLOAT, 176]
  %var44[FLOAT, 176]
  %scale45[FLOAT, 176]
  %bias45[FLOAT, 176]
  %mean45[FLOAT, 176]
  %var45[FLOAT, 176]
  %normal_A_block_11_1/block_1/separable_conv_block_normal_left1_11/separable_conv_1_normal_left1_11/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W28[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_1/separable_conv_block_normal_right1_11/separable_conv_1_normal_right1_11/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W29[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_2/separable_conv_block_normal_left2_11/separable_conv_1_normal_left2_11/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W30[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_2/separable_conv_block_normal_right2_11/separable_conv_1_normal_right2_11/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W31[FLOAT, 176x176x1x1]
  %normal_A_block_11_1/block_5/separable_conv_block_normal_left5_11/separable_conv_1_normal_left5_11/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W32[FLOAT, 176x176x1x1]
  %scale46[FLOAT, 176]
  %bias46[FLOAT, 176]
  %mean46[FLOAT, 176]
  %var46[FLOAT, 176]
  %scale47[FLOAT, 176]
  %bias47[FLOAT, 176]
  %mean47[FLOAT, 176]
  %var47[FLOAT, 176]
  %scale48[FLOAT, 176]
  %bias48[FLOAT, 176]
  %mean48[FLOAT, 176]
  %var48[FLOAT, 176]
  %normal_A_block_9_1/adjust_block/adjust_reduction_block_9/adjust_conv_1_9/kernel:0[FLOAT, 88x528x1x1]
  %normal_A_block_9_1/adjust_block/adjust_reduction_block_9/adjust_conv_2_9/kernel:0[FLOAT, 88x528x1x1]
  %normal_A_block_9_1/block_1/separable_conv_block_normal_left1_9/separable_conv_2_normal_left1_9/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W33[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_1/separable_conv_block_normal_right1_9/separable_conv_2_normal_right1_9/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W34[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_2/separable_conv_block_normal_left2_9/separable_conv_2_normal_left2_9/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W35[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_2/separable_conv_block_normal_right2_9/separable_conv_2_normal_right2_9/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W36[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_5/separable_conv_block_normal_left5_9/separable_conv_2_normal_left5_9/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W37[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/normal_conv_1_9/kernel:0[FLOAT, 176x704x1x1]
  %reduction_A_block_reduce_8_1/reduction_conv_1_reduce_8/kernel:0[FLOAT, 176x528x1x1]
  %scale49[FLOAT, 176]
  %bias49[FLOAT, 176]
  %mean49[FLOAT, 176]
  %var49[FLOAT, 176]
  %scale50[FLOAT, 176]
  %bias50[FLOAT, 176]
  %mean50[FLOAT, 176]
  %var50[FLOAT, 176]
  %reduction_A_block_reduce_8_1/block_1/separable_conv_block_reduction_left1_reduce_8/separable_conv_2_reduction_left1_reduce_8/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W38[FLOAT, 176x176x1x1]
  %reduction_A_block_reduce_8_1/block_1/separable_conv_block_reduction_right1_reduce_8/separable_conv_2_reduction_right1_reduce_8/depthwise_kernel:0[FLOAT, 176x1x7x7]
  %W39[FLOAT, 176x176x1x1]
  %scale51[FLOAT, 176]
  %bias51[FLOAT, 176]
  %mean51[FLOAT, 176]
  %var51[FLOAT, 176]
  %reduction_A_block_reduce_8_1/block_2/separable_conv_block_reduction_right2_reduce_8/separable_conv_1_reduction_right2_reduce_8/depthwise_kernel:0[FLOAT, 176x1x7x7]
  %W40[FLOAT, 176x176x1x1]
  %reduction_A_block_reduce_8_1/block_3/separable_conv_block_reduction_right3_reduce_8/separable_conv_1_reduction_right3_reduce_8/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W41[FLOAT, 176x176x1x1]
  %reduction_A_block_reduce_8_1/block_5/separable_conv_block_reduction_left4_reduce_8/separable_conv_1_reduction_left4_reduce_8/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W42[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/adjust_block/adjust_reduction_block_9/zero_padding2d_14/Pad:0_cropping_start[INT64, 4]
  %normal_A_block_9_1/adjust_block/adjust_reduction_block_9/zero_padding2d_14/Pad:0_cropping_end[INT64, 4]
  %normal_A_block_9_1/adjust_block/adjust_reduction_block_9/zero_padding2d_14/Pad:0_cropping_axes[INT64, 4]
  %scale52[FLOAT, 176]
  %bias52[FLOAT, 176]
  %mean52[FLOAT, 176]
  %var52[FLOAT, 176]
  %scale53[FLOAT, 176]
  %bias53[FLOAT, 176]
  %mean53[FLOAT, 176]
  %var53[FLOAT, 176]
  %scale54[FLOAT, 176]
  %bias54[FLOAT, 176]
  %mean54[FLOAT, 176]
  %var54[FLOAT, 176]
  %scale55[FLOAT, 176]
  %bias55[FLOAT, 176]
  %mean55[FLOAT, 176]
  %var55[FLOAT, 176]
  %scale56[FLOAT, 176]
  %bias56[FLOAT, 176]
  %mean56[FLOAT, 176]
  %var56[FLOAT, 176]
  %Pad1_pads[INT64, 8]
  %Pad1_value[FLOAT, scalar]
  %Pad2_pads[INT64, 8]
  %Pad2_value[FLOAT, scalar]
  %scale57[FLOAT, 176]
  %bias57[FLOAT, 176]
  %mean57[FLOAT, 176]
  %var57[FLOAT, 176]
  %scale58[FLOAT, 176]
  %bias58[FLOAT, 176]
  %mean58[FLOAT, 176]
  %var58[FLOAT, 176]
  %Pad3_pads[INT64, 8]
  %Pad3_value[FLOAT, scalar]
  %normal_A_block_9_1/block_1/separable_conv_block_normal_left1_9/separable_conv_1_normal_left1_9/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W43[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_1/separable_conv_block_normal_right1_9/separable_conv_1_normal_right1_9/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W44[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_2/separable_conv_block_normal_left2_9/separable_conv_1_normal_left2_9/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W45[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_2/separable_conv_block_normal_right2_9/separable_conv_1_normal_right2_9/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W46[FLOAT, 176x176x1x1]
  %normal_A_block_9_1/block_5/separable_conv_block_normal_left5_9/separable_conv_1_normal_left5_9/depthwise_kernel:0[FLOAT, 176x1x3x3]
  %W47[FLOAT, 176x176x1x1]
  %scale59[FLOAT, 88]
  %bias59[FLOAT, 88]
  %mean59[FLOAT, 88]
  %var59[FLOAT, 88]
  %reduction_A_block_reduce_8_1/block_1/separable_conv_block_reduction_left1_reduce_8/separable_conv_1_reduction_left1_reduce_8/depthwise_kernel:0[FLOAT, 176x1x5x5]
  %W48[FLOAT, 176x176x1x1]
  %reduction_A_block_reduce_8_1/block_1/separable_conv_block_reduction_right1_reduce_8/separable_conv_1_reduction_right1_reduce_8/depthwise_kernel:0[FLOAT, 176x1x7x7]
  %W49[FLOAT, 176x176x1x1]
  %normal_A_block_8_1/adjust_block/adjust_projection_block_8/adjust_conv_projection_8/kernel:0[FLOAT, 88x528x1x1]
  %scale60[FLOAT, 88]
  %bias60[FLOAT, 88]
  %mean60[FLOAT, 88]
  %var60[FLOAT, 88]
  %scale61[FLOAT, 88]
  %bias61[FLOAT, 88]
  %mean61[FLOAT, 88]
  %var61[FLOAT, 88]
  %scale62[FLOAT, 88]
  %bias62[FLOAT, 88]
  %mean62[FLOAT, 88]
  %var62[FLOAT, 88]
  %scale63[FLOAT, 88]
  %bias63[FLOAT, 88]
  %mean63[FLOAT, 88]
  %var63[FLOAT, 88]
  %scale64[FLOAT, 88]
  %bias64[FLOAT, 88]
  %mean64[FLOAT, 88]
  %var64[FLOAT, 88]
  %scale65[FLOAT, 88]
  %bias65[FLOAT, 88]
  %mean65[FLOAT, 88]
  %var65[FLOAT, 88]
  %scale66[FLOAT, 176]
  %bias66[FLOAT, 176]
  %mean66[FLOAT, 176]
  %var66[FLOAT, 176]
  %Pad4_pads[INT64, 8]
  %Pad4_value[FLOAT, scalar]
  %Pad5_pads[INT64, 8]
  %Pad5_value[FLOAT, scalar]
  %normal_A_block_8_1/block_1/separable_conv_block_normal_left1_8/separable_conv_2_normal_left1_8/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W50[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_1/separable_conv_block_normal_right1_8/separable_conv_2_normal_right1_8/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W51[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_2/separable_conv_block_normal_left2_8/separable_conv_2_normal_left2_8/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W52[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_2/separable_conv_block_normal_right2_8/separable_conv_2_normal_right2_8/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W53[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_5/separable_conv_block_normal_left5_8/separable_conv_2_normal_left5_8/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W54[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/normal_conv_1_8/kernel:0[FLOAT, 88x528x1x1]
  %reduction_A_block_reduce_8_1/adjust_block/adjust_projection_block_reduce_8/adjust_conv_projection_reduce_8/kernel:0[FLOAT, 176x528x1x1]
  %scale67[FLOAT, 88]
  %bias67[FLOAT, 88]
  %mean67[FLOAT, 88]
  %var67[FLOAT, 88]
  %scale68[FLOAT, 88]
  %bias68[FLOAT, 88]
  %mean68[FLOAT, 88]
  %var68[FLOAT, 88]
  %scale69[FLOAT, 88]
  %bias69[FLOAT, 88]
  %mean69[FLOAT, 88]
  %var69[FLOAT, 88]
  %scale70[FLOAT, 88]
  %bias70[FLOAT, 88]
  %mean70[FLOAT, 88]
  %var70[FLOAT, 88]
  %scale71[FLOAT, 88]
  %bias71[FLOAT, 88]
  %mean71[FLOAT, 88]
  %var71[FLOAT, 88]
  %scale72[FLOAT, 88]
  %bias72[FLOAT, 88]
  %mean72[FLOAT, 88]
  %var72[FLOAT, 88]
  %normal_A_block_6_1/adjust_block/adjust_projection_block_6/adjust_conv_projection_6/kernel:0[FLOAT, 88x352x1x1]
  %scale73[FLOAT, 88]
  %bias73[FLOAT, 88]
  %mean73[FLOAT, 88]
  %var73[FLOAT, 88]
  %scale74[FLOAT, 88]
  %bias74[FLOAT, 88]
  %mean74[FLOAT, 88]
  %var74[FLOAT, 88]
  %scale75[FLOAT, 88]
  %bias75[FLOAT, 88]
  %mean75[FLOAT, 88]
  %var75[FLOAT, 88]
  %scale76[FLOAT, 88]
  %bias76[FLOAT, 88]
  %mean76[FLOAT, 88]
  %var76[FLOAT, 88]
  %scale77[FLOAT, 88]
  %bias77[FLOAT, 88]
  %mean77[FLOAT, 88]
  %var77[FLOAT, 88]
  %scale78[FLOAT, 88]
  %bias78[FLOAT, 88]
  %mean78[FLOAT, 88]
  %var78[FLOAT, 88]
  %normal_A_block_8_1/block_1/separable_conv_block_normal_left1_8/separable_conv_1_normal_left1_8/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W55[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_1/separable_conv_block_normal_right1_8/separable_conv_1_normal_right1_8/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W56[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_2/separable_conv_block_normal_left2_8/separable_conv_1_normal_left2_8/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W57[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_2/separable_conv_block_normal_right2_8/separable_conv_1_normal_right2_8/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W58[FLOAT, 88x88x1x1]
  %normal_A_block_8_1/block_5/separable_conv_block_normal_left5_8/separable_conv_1_normal_left5_8/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W59[FLOAT, 88x88x1x1]
  %scale79[FLOAT, 88]
  %bias79[FLOAT, 88]
  %mean79[FLOAT, 88]
  %var79[FLOAT, 88]
  %normal_A_block_6_1/block_1/separable_conv_block_normal_left1_6/separable_conv_2_normal_left1_6/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W60[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_1/separable_conv_block_normal_right1_6/separable_conv_2_normal_right1_6/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W61[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_2/separable_conv_block_normal_left2_6/separable_conv_2_normal_left2_6/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W62[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_2/separable_conv_block_normal_right2_6/separable_conv_2_normal_right2_6/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W63[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_5/separable_conv_block_normal_left5_6/separable_conv_2_normal_left5_6/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W64[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/normal_conv_1_6/kernel:0[FLOAT, 88x528x1x1]
  %normal_A_block_7_1/adjust_block/adjust_projection_block_7/adjust_conv_projection_7/kernel:0[FLOAT, 88x528x1x1]
  %scale80[FLOAT, 88]
  %bias80[FLOAT, 88]
  %mean80[FLOAT, 88]
  %var80[FLOAT, 88]
  %scale81[FLOAT, 88]
  %bias81[FLOAT, 88]
  %mean81[FLOAT, 88]
  %var81[FLOAT, 88]
  %scale82[FLOAT, 88]
  %bias82[FLOAT, 88]
  %mean82[FLOAT, 88]
  %var82[FLOAT, 88]
  %scale83[FLOAT, 88]
  %bias83[FLOAT, 88]
  %mean83[FLOAT, 88]
  %var83[FLOAT, 88]
  %scale84[FLOAT, 88]
  %bias84[FLOAT, 88]
  %mean84[FLOAT, 88]
  %var84[FLOAT, 88]
  %scale85[FLOAT, 88]
  %bias85[FLOAT, 88]
  %mean85[FLOAT, 88]
  %var85[FLOAT, 88]
  %normal_A_block_7_1/block_1/separable_conv_block_normal_left1_7/separable_conv_2_normal_left1_7/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W65[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_1/separable_conv_block_normal_right1_7/separable_conv_2_normal_right1_7/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W66[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_2/separable_conv_block_normal_left2_7/separable_conv_2_normal_left2_7/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W67[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_2/separable_conv_block_normal_right2_7/separable_conv_2_normal_right2_7/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W68[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_5/separable_conv_block_normal_left5_7/separable_conv_2_normal_left5_7/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W69[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/normal_conv_1_7/kernel:0[FLOAT, 88x528x1x1]
  %scale86[FLOAT, 88]
  %bias86[FLOAT, 88]
  %mean86[FLOAT, 88]
  %var86[FLOAT, 88]
  %scale87[FLOAT, 88]
  %bias87[FLOAT, 88]
  %mean87[FLOAT, 88]
  %var87[FLOAT, 88]
  %scale88[FLOAT, 88]
  %bias88[FLOAT, 88]
  %mean88[FLOAT, 88]
  %var88[FLOAT, 88]
  %scale89[FLOAT, 88]
  %bias89[FLOAT, 88]
  %mean89[FLOAT, 88]
  %var89[FLOAT, 88]
  %scale90[FLOAT, 88]
  %bias90[FLOAT, 88]
  %mean90[FLOAT, 88]
  %var90[FLOAT, 88]
  %scale91[FLOAT, 88]
  %bias91[FLOAT, 88]
  %mean91[FLOAT, 88]
  %var91[FLOAT, 88]
  %scale92[FLOAT, 88]
  %bias92[FLOAT, 88]
  %mean92[FLOAT, 88]
  %var92[FLOAT, 88]
  %scale93[FLOAT, 88]
  %bias93[FLOAT, 88]
  %mean93[FLOAT, 88]
  %var93[FLOAT, 88]
  %normal_A_block_6_1/block_1/separable_conv_block_normal_left1_6/separable_conv_1_normal_left1_6/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W70[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_1/separable_conv_block_normal_right1_6/separable_conv_1_normal_right1_6/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W71[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_2/separable_conv_block_normal_left2_6/separable_conv_1_normal_left2_6/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W72[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_2/separable_conv_block_normal_right2_6/separable_conv_1_normal_right2_6/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W73[FLOAT, 88x88x1x1]
  %normal_A_block_6_1/block_5/separable_conv_block_normal_left5_6/separable_conv_1_normal_left5_6/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W74[FLOAT, 88x88x1x1]
  %scale94[FLOAT, 88]
  %bias94[FLOAT, 88]
  %mean94[FLOAT, 88]
  %var94[FLOAT, 88]
  %scale95[FLOAT, 88]
  %bias95[FLOAT, 88]
  %mean95[FLOAT, 88]
  %var95[FLOAT, 88]
  %scale96[FLOAT, 88]
  %bias96[FLOAT, 88]
  %mean96[FLOAT, 88]
  %var96[FLOAT, 88]
  %scale97[FLOAT, 88]
  %bias97[FLOAT, 88]
  %mean97[FLOAT, 88]
  %var97[FLOAT, 88]
  %scale98[FLOAT, 88]
  %bias98[FLOAT, 88]
  %mean98[FLOAT, 88]
  %var98[FLOAT, 88]
  %scale99[FLOAT, 88]
  %bias99[FLOAT, 88]
  %mean99[FLOAT, 88]
  %var99[FLOAT, 88]
  %Pad6_pads[INT64, 8]
  %Pad6_value[FLOAT, scalar]
  %reduction_A_block_reduce_4_1/block_2/separable_conv_block_reduction_right2_reduce_4/separable_conv_2_reduction_right2_reduce_4/depthwise_kernel:0[FLOAT, 88x1x7x7]
  %W75[FLOAT, 88x88x1x1]
  %reduction_A_block_reduce_4_1/block_3/separable_conv_block_reduction_right3_reduce_4/separable_conv_2_reduction_right3_reduce_4/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W76[FLOAT, 88x88x1x1]
  %reduction_A_block_reduce_4_1/block_5/separable_conv_block_reduction_left4_reduce_4/separable_conv_2_reduction_left4_reduce_4/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W77[FLOAT, 88x88x1x1]
  %scale100[FLOAT, 88]
  %bias100[FLOAT, 88]
  %mean100[FLOAT, 88]
  %var100[FLOAT, 88]
  %scale101[FLOAT, 88]
  %bias101[FLOAT, 88]
  %mean101[FLOAT, 88]
  %var101[FLOAT, 88]
  %scale102[FLOAT, 88]
  %bias102[FLOAT, 88]
  %mean102[FLOAT, 88]
  %var102[FLOAT, 88]
  %scale103[FLOAT, 88]
  %bias103[FLOAT, 88]
  %mean103[FLOAT, 88]
  %var103[FLOAT, 88]
  %scale104[FLOAT, 88]
  %bias104[FLOAT, 88]
  %mean104[FLOAT, 88]
  %var104[FLOAT, 88]
  %scale105[FLOAT, 88]
  %bias105[FLOAT, 88]
  %mean105[FLOAT, 88]
  %var105[FLOAT, 88]
  %normal_A_block_7_1/block_1/separable_conv_block_normal_left1_7/separable_conv_1_normal_left1_7/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W78[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_1/separable_conv_block_normal_right1_7/separable_conv_1_normal_right1_7/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W79[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_2/separable_conv_block_normal_left2_7/separable_conv_1_normal_left2_7/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W80[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_2/separable_conv_block_normal_right2_7/separable_conv_1_normal_right2_7/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W81[FLOAT, 88x88x1x1]
  %normal_A_block_7_1/block_5/separable_conv_block_normal_left5_7/separable_conv_1_normal_left5_7/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W82[FLOAT, 88x88x1x1]
  %scale106[FLOAT, 88]
  %bias106[FLOAT, 88]
  %mean106[FLOAT, 88]
  %var106[FLOAT, 88]
  %scale107[FLOAT, 88]
  %bias107[FLOAT, 88]
  %mean107[FLOAT, 88]
  %var107[FLOAT, 88]
  %scale108[FLOAT, 88]
  %bias108[FLOAT, 88]
  %mean108[FLOAT, 88]
  %var108[FLOAT, 88]
  %normal_A_block_5_1/adjust_block/adjust_reduction_block_5/adjust_conv_1_5/kernel:0[FLOAT, 44x264x1x1]
  %normal_A_block_5_1/adjust_block/adjust_reduction_block_5/adjust_conv_2_5/kernel:0[FLOAT, 44x264x1x1]
  %normal_A_block_5_1/block_1/separable_conv_block_normal_left1_5/separable_conv_2_normal_left1_5/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W83[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_1/separable_conv_block_normal_right1_5/separable_conv_2_normal_right1_5/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W84[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_2/separable_conv_block_normal_left2_5/separable_conv_2_normal_left2_5/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W85[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_2/separable_conv_block_normal_right2_5/separable_conv_2_normal_right2_5/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W86[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_5/separable_conv_block_normal_left5_5/separable_conv_2_normal_left5_5/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W87[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/normal_conv_1_5/kernel:0[FLOAT, 88x352x1x1]
  %reduction_A_block_reduce_4_1/reduction_conv_1_reduce_4/kernel:0[FLOAT, 88x264x1x1]
  %scale109[FLOAT, 88]
  %bias109[FLOAT, 88]
  %mean109[FLOAT, 88]
  %var109[FLOAT, 88]
  %scale110[FLOAT, 88]
  %bias110[FLOAT, 88]
  %mean110[FLOAT, 88]
  %var110[FLOAT, 88]
  %reduction_A_block_reduce_4_1/block_1/separable_conv_block_reduction_left1_reduce_4/separable_conv_2_reduction_left1_reduce_4/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W88[FLOAT, 88x88x1x1]
  %reduction_A_block_reduce_4_1/block_1/separable_conv_block_reduction_right1_reduce_4/separable_conv_2_reduction_right1_reduce_4/depthwise_kernel:0[FLOAT, 88x1x7x7]
  %W89[FLOAT, 88x88x1x1]
  %scale111[FLOAT, 88]
  %bias111[FLOAT, 88]
  %mean111[FLOAT, 88]
  %var111[FLOAT, 88]
  %reduction_A_block_reduce_4_1/block_2/separable_conv_block_reduction_right2_reduce_4/separable_conv_1_reduction_right2_reduce_4/depthwise_kernel:0[FLOAT, 88x1x7x7]
  %W90[FLOAT, 88x88x1x1]
  %reduction_A_block_reduce_4_1/block_3/separable_conv_block_reduction_right3_reduce_4/separable_conv_1_reduction_right3_reduce_4/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W91[FLOAT, 88x88x1x1]
  %reduction_A_block_reduce_4_1/block_5/separable_conv_block_reduction_left4_reduce_4/separable_conv_1_reduction_left4_reduce_4/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W92[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/adjust_block/adjust_reduction_block_5/zero_padding2d_13/Pad:0_cropping_start[INT64, 4]
  %normal_A_block_5_1/adjust_block/adjust_reduction_block_5/zero_padding2d_13/Pad:0_cropping_end[INT64, 4]
  %normal_A_block_5_1/adjust_block/adjust_reduction_block_5/zero_padding2d_13/Pad:0_cropping_axes[INT64, 4]
  %scale112[FLOAT, 88]
  %bias112[FLOAT, 88]
  %mean112[FLOAT, 88]
  %var112[FLOAT, 88]
  %scale113[FLOAT, 88]
  %bias113[FLOAT, 88]
  %mean113[FLOAT, 88]
  %var113[FLOAT, 88]
  %scale114[FLOAT, 88]
  %bias114[FLOAT, 88]
  %mean114[FLOAT, 88]
  %var114[FLOAT, 88]
  %scale115[FLOAT, 88]
  %bias115[FLOAT, 88]
  %mean115[FLOAT, 88]
  %var115[FLOAT, 88]
  %scale116[FLOAT, 88]
  %bias116[FLOAT, 88]
  %mean116[FLOAT, 88]
  %var116[FLOAT, 88]
  %Pad7_pads[INT64, 8]
  %Pad7_value[FLOAT, scalar]
  %Pad8_pads[INT64, 8]
  %Pad8_value[FLOAT, scalar]
  %scale117[FLOAT, 88]
  %bias117[FLOAT, 88]
  %mean117[FLOAT, 88]
  %var117[FLOAT, 88]
  %scale118[FLOAT, 88]
  %bias118[FLOAT, 88]
  %mean118[FLOAT, 88]
  %var118[FLOAT, 88]
  %Pad9_pads[INT64, 8]
  %Pad9_value[FLOAT, scalar]
  %normal_A_block_5_1/block_1/separable_conv_block_normal_left1_5/separable_conv_1_normal_left1_5/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W93[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_1/separable_conv_block_normal_right1_5/separable_conv_1_normal_right1_5/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W94[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_2/separable_conv_block_normal_left2_5/separable_conv_1_normal_left2_5/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W95[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_2/separable_conv_block_normal_right2_5/separable_conv_1_normal_right2_5/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W96[FLOAT, 88x88x1x1]
  %normal_A_block_5_1/block_5/separable_conv_block_normal_left5_5/separable_conv_1_normal_left5_5/depthwise_kernel:0[FLOAT, 88x1x3x3]
  %W97[FLOAT, 88x88x1x1]
  %scale119[FLOAT, 44]
  %bias119[FLOAT, 44]
  %mean119[FLOAT, 44]
  %var119[FLOAT, 44]
  %reduction_A_block_reduce_4_1/block_1/separable_conv_block_reduction_left1_reduce_4/separable_conv_1_reduction_left1_reduce_4/depthwise_kernel:0[FLOAT, 88x1x5x5]
  %W98[FLOAT, 88x88x1x1]
  %reduction_A_block_reduce_4_1/block_1/separable_conv_block_reduction_right1_reduce_4/separable_conv_1_reduction_right1_reduce_4/depthwise_kernel:0[FLOAT, 88x1x7x7]
  %W99[FLOAT, 88x88x1x1]
  %normal_A_block_3_1/adjust_block/adjust_projection_block_3/adjust_conv_projection_3/kernel:0[FLOAT, 44x264x1x1]
  %scale120[FLOAT, 44]
  %bias120[FLOAT, 44]
  %mean120[FLOAT, 44]
  %var120[FLOAT, 44]
  %scale121[FLOAT, 44]
  %bias121[FLOAT, 44]
  %mean121[FLOAT, 44]
  %var121[FLOAT, 44]
  %scale122[FLOAT, 44]
  %bias122[FLOAT, 44]
  %mean122[FLOAT, 44]
  %var122[FLOAT, 44]
  %scale123[FLOAT, 44]
  %bias123[FLOAT, 44]
  %mean123[FLOAT, 44]
  %var123[FLOAT, 44]
  %scale124[FLOAT, 44]
  %bias124[FLOAT, 44]
  %mean124[FLOAT, 44]
  %var124[FLOAT, 44]
  %scale125[FLOAT, 44]
  %bias125[FLOAT, 44]
  %mean125[FLOAT, 44]
  %var125[FLOAT, 44]
  %scale126[FLOAT, 88]
  %bias126[FLOAT, 88]
  %mean126[FLOAT, 88]
  %var126[FLOAT, 88]
  %Pad10_pads[INT64, 8]
  %Pad10_value[FLOAT, scalar]
  %Pad11_pads[INT64, 8]
  %Pad11_value[FLOAT, scalar]
  %normal_A_block_3_1/block_1/separable_conv_block_normal_left1_3/separable_conv_2_normal_left1_3/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W100[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_1/separable_conv_block_normal_right1_3/separable_conv_2_normal_right1_3/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W101[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_2/separable_conv_block_normal_left2_3/separable_conv_2_normal_left2_3/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W102[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_2/separable_conv_block_normal_right2_3/separable_conv_2_normal_right2_3/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W103[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_5/separable_conv_block_normal_left5_3/separable_conv_2_normal_left5_3/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W104[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/normal_conv_1_3/kernel:0[FLOAT, 44x264x1x1]
  %reduction_A_block_reduce_4_1/adjust_block/adjust_projection_block_reduce_4/adjust_conv_projection_reduce_4/kernel:0[FLOAT, 88x264x1x1]
  %scale127[FLOAT, 44]
  %bias127[FLOAT, 44]
  %mean127[FLOAT, 44]
  %var127[FLOAT, 44]
  %scale128[FLOAT, 44]
  %bias128[FLOAT, 44]
  %mean128[FLOAT, 44]
  %var128[FLOAT, 44]
  %scale129[FLOAT, 44]
  %bias129[FLOAT, 44]
  %mean129[FLOAT, 44]
  %var129[FLOAT, 44]
  %scale130[FLOAT, 44]
  %bias130[FLOAT, 44]
  %mean130[FLOAT, 44]
  %var130[FLOAT, 44]
  %scale131[FLOAT, 44]
  %bias131[FLOAT, 44]
  %mean131[FLOAT, 44]
  %var131[FLOAT, 44]
  %scale132[FLOAT, 44]
  %bias132[FLOAT, 44]
  %mean132[FLOAT, 44]
  %var132[FLOAT, 44]
  %normal_A_block_1_1/adjust_block/adjust_projection_block_1/adjust_conv_projection_1/kernel:0[FLOAT, 44x88x1x1]
  %scale133[FLOAT, 44]
  %bias133[FLOAT, 44]
  %mean133[FLOAT, 44]
  %var133[FLOAT, 44]
  %scale134[FLOAT, 44]
  %bias134[FLOAT, 44]
  %mean134[FLOAT, 44]
  %var134[FLOAT, 44]
  %scale135[FLOAT, 44]
  %bias135[FLOAT, 44]
  %mean135[FLOAT, 44]
  %var135[FLOAT, 44]
  %scale136[FLOAT, 44]
  %bias136[FLOAT, 44]
  %mean136[FLOAT, 44]
  %var136[FLOAT, 44]
  %scale137[FLOAT, 44]
  %bias137[FLOAT, 44]
  %mean137[FLOAT, 44]
  %var137[FLOAT, 44]
  %scale138[FLOAT, 44]
  %bias138[FLOAT, 44]
  %mean138[FLOAT, 44]
  %var138[FLOAT, 44]
  %normal_A_block_3_1/block_1/separable_conv_block_normal_left1_3/separable_conv_1_normal_left1_3/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W105[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_1/separable_conv_block_normal_right1_3/separable_conv_1_normal_right1_3/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W106[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_2/separable_conv_block_normal_left2_3/separable_conv_1_normal_left2_3/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W107[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_2/separable_conv_block_normal_right2_3/separable_conv_1_normal_right2_3/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W108[FLOAT, 44x44x1x1]
  %normal_A_block_3_1/block_5/separable_conv_block_normal_left5_3/separable_conv_1_normal_left5_3/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W109[FLOAT, 44x44x1x1]
  %scale139[FLOAT, 44]
  %bias139[FLOAT, 44]
  %mean139[FLOAT, 44]
  %var139[FLOAT, 44]
  %normal_A_block_1_1/block_1/separable_conv_block_normal_left1_1/separable_conv_2_normal_left1_1/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W110[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_1/separable_conv_block_normal_right1_1/separable_conv_2_normal_right1_1/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W111[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_2/separable_conv_block_normal_left2_1/separable_conv_2_normal_left2_1/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W112[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_2/separable_conv_block_normal_right2_1/separable_conv_2_normal_right2_1/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W113[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_5/separable_conv_block_normal_left5_1/separable_conv_2_normal_left5_1/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W114[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/normal_conv_1_1/kernel:0[FLOAT, 44x264x1x1]
  %normal_A_block_2_1/adjust_block/adjust_projection_block_2/adjust_conv_projection_2/kernel:0[FLOAT, 44x264x1x1]
  %scale140[FLOAT, 44]
  %bias140[FLOAT, 44]
  %mean140[FLOAT, 44]
  %var140[FLOAT, 44]
  %scale141[FLOAT, 44]
  %bias141[FLOAT, 44]
  %mean141[FLOAT, 44]
  %var141[FLOAT, 44]
  %scale142[FLOAT, 44]
  %bias142[FLOAT, 44]
  %mean142[FLOAT, 44]
  %var142[FLOAT, 44]
  %scale143[FLOAT, 44]
  %bias143[FLOAT, 44]
  %mean143[FLOAT, 44]
  %var143[FLOAT, 44]
  %scale144[FLOAT, 44]
  %bias144[FLOAT, 44]
  %mean144[FLOAT, 44]
  %var144[FLOAT, 44]
  %scale145[FLOAT, 44]
  %bias145[FLOAT, 44]
  %mean145[FLOAT, 44]
  %var145[FLOAT, 44]
  %normal_A_block_2_1/block_1/separable_conv_block_normal_left1_2/separable_conv_2_normal_left1_2/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W115[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_1/separable_conv_block_normal_right1_2/separable_conv_2_normal_right1_2/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W116[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_2/separable_conv_block_normal_left2_2/separable_conv_2_normal_left2_2/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W117[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_2/separable_conv_block_normal_right2_2/separable_conv_2_normal_right2_2/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W118[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_5/separable_conv_block_normal_left5_2/separable_conv_2_normal_left5_2/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W119[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/normal_conv_1_2/kernel:0[FLOAT, 44x264x1x1]
  %scale146[FLOAT, 44]
  %bias146[FLOAT, 44]
  %mean146[FLOAT, 44]
  %var146[FLOAT, 44]
  %scale147[FLOAT, 44]
  %bias147[FLOAT, 44]
  %mean147[FLOAT, 44]
  %var147[FLOAT, 44]
  %scale148[FLOAT, 44]
  %bias148[FLOAT, 44]
  %mean148[FLOAT, 44]
  %var148[FLOAT, 44]
  %scale149[FLOAT, 44]
  %bias149[FLOAT, 44]
  %mean149[FLOAT, 44]
  %var149[FLOAT, 44]
  %scale150[FLOAT, 44]
  %bias150[FLOAT, 44]
  %mean150[FLOAT, 44]
  %var150[FLOAT, 44]
  %scale151[FLOAT, 22]
  %bias151[FLOAT, 22]
  %mean151[FLOAT, 22]
  %var151[FLOAT, 22]
  %scale152[FLOAT, 22]
  %bias152[FLOAT, 22]
  %mean152[FLOAT, 22]
  %var152[FLOAT, 22]
  %scale153[FLOAT, 22]
  %bias153[FLOAT, 22]
  %mean153[FLOAT, 22]
  %var153[FLOAT, 22]
  %normal_A_block_1_1/block_1/separable_conv_block_normal_left1_1/separable_conv_1_normal_left1_1/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W120[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_1/separable_conv_block_normal_right1_1/separable_conv_1_normal_right1_1/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W121[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_2/separable_conv_block_normal_left2_1/separable_conv_1_normal_left2_1/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W122[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_2/separable_conv_block_normal_right2_1/separable_conv_1_normal_right2_1/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W123[FLOAT, 44x44x1x1]
  %normal_A_block_1_1/block_5/separable_conv_block_normal_left5_1/separable_conv_1_normal_left5_1/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W124[FLOAT, 44x44x1x1]
  %scale154[FLOAT, 44]
  %bias154[FLOAT, 44]
  %mean154[FLOAT, 44]
  %var154[FLOAT, 44]
  %scale155[FLOAT, 44]
  %bias155[FLOAT, 44]
  %mean155[FLOAT, 44]
  %var155[FLOAT, 44]
  %scale156[FLOAT, 44]
  %bias156[FLOAT, 44]
  %mean156[FLOAT, 44]
  %var156[FLOAT, 44]
  %scale157[FLOAT, 44]
  %bias157[FLOAT, 44]
  %mean157[FLOAT, 44]
  %var157[FLOAT, 44]
  %scale158[FLOAT, 44]
  %bias158[FLOAT, 44]
  %mean158[FLOAT, 44]
  %var158[FLOAT, 44]
  %scale159[FLOAT, 44]
  %bias159[FLOAT, 44]
  %mean159[FLOAT, 44]
  %var159[FLOAT, 44]
  %Pad12_pads[INT64, 8]
  %Pad12_value[FLOAT, scalar]
  %reduction_A_block_stem_2_1/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_2_reduction_right2_stem_2/depthwise_kernel:0[FLOAT, 22x1x7x7]
  %W125[FLOAT, 22x22x1x1]
  %reduction_A_block_stem_2_1/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_2_reduction_right3_stem_2/depthwise_kernel:0[FLOAT, 22x1x5x5]
  %W126[FLOAT, 22x22x1x1]
  %reduction_A_block_stem_2_1/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_2_reduction_left4_stem_2/depthwise_kernel:0[FLOAT, 22x1x3x3]
  %W127[FLOAT, 22x22x1x1]
  %scale160[FLOAT, 44]
  %bias160[FLOAT, 44]
  %mean160[FLOAT, 44]
  %var160[FLOAT, 44]
  %scale161[FLOAT, 44]
  %bias161[FLOAT, 44]
  %mean161[FLOAT, 44]
  %var161[FLOAT, 44]
  %scale162[FLOAT, 44]
  %bias162[FLOAT, 44]
  %mean162[FLOAT, 44]
  %var162[FLOAT, 44]
  %scale163[FLOAT, 44]
  %bias163[FLOAT, 44]
  %mean163[FLOAT, 44]
  %var163[FLOAT, 44]
  %scale164[FLOAT, 44]
  %bias164[FLOAT, 44]
  %mean164[FLOAT, 44]
  %var164[FLOAT, 44]
  %scale165[FLOAT, 44]
  %bias165[FLOAT, 44]
  %mean165[FLOAT, 44]
  %var165[FLOAT, 44]
  %normal_A_block_2_1/block_1/separable_conv_block_normal_left1_2/separable_conv_1_normal_left1_2/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W128[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_1/separable_conv_block_normal_right1_2/separable_conv_1_normal_right1_2/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W129[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_2/separable_conv_block_normal_left2_2/separable_conv_1_normal_left2_2/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W130[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_2/separable_conv_block_normal_right2_2/separable_conv_1_normal_right2_2/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W131[FLOAT, 44x44x1x1]
  %normal_A_block_2_1/block_5/separable_conv_block_normal_left5_2/separable_conv_1_normal_left5_2/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W132[FLOAT, 44x44x1x1]
  %scale166[FLOAT, 22]
  %bias166[FLOAT, 22]
  %mean166[FLOAT, 22]
  %var166[FLOAT, 22]
  %scale167[FLOAT, 22]
  %bias167[FLOAT, 22]
  %mean167[FLOAT, 22]
  %var167[FLOAT, 22]
  %scale168[FLOAT, 22]
  %bias168[FLOAT, 22]
  %mean168[FLOAT, 22]
  %var168[FLOAT, 22]
  %normal_A_block_0_1/adjust_block/adjust_reduction_block_0/adjust_conv_1_0/kernel:0[FLOAT, 22x44x1x1]
  %normal_A_block_0_1/adjust_block/adjust_reduction_block_0/adjust_conv_2_0/kernel:0[FLOAT, 22x44x1x1]
  %normal_A_block_0_1/block_1/separable_conv_block_normal_left1_0/separable_conv_2_normal_left1_0/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W133[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_1/separable_conv_block_normal_right1_0/separable_conv_2_normal_right1_0/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W134[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_2/separable_conv_block_normal_left2_0/separable_conv_2_normal_left2_0/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W135[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_2/separable_conv_block_normal_right2_0/separable_conv_2_normal_right2_0/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W136[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_5/separable_conv_block_normal_left5_0/separable_conv_2_normal_left5_0/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W137[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/normal_conv_1_0/kernel:0[FLOAT, 44x88x1x1]
  %reduction_A_block_stem_2_1/reduction_conv_1_stem_2/kernel:0[FLOAT, 22x44x1x1]
  %scale169[FLOAT, 22]
  %bias169[FLOAT, 22]
  %mean169[FLOAT, 22]
  %var169[FLOAT, 22]
  %scale170[FLOAT, 22]
  %bias170[FLOAT, 22]
  %mean170[FLOAT, 22]
  %var170[FLOAT, 22]
  %reduction_A_block_stem_2_1/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_2_reduction_left1_stem_2/depthwise_kernel:0[FLOAT, 22x1x5x5]
  %W138[FLOAT, 22x22x1x1]
  %reduction_A_block_stem_2_1/block_1/separable_conv_block_reduction_right1_stem_2/separable_conv_2_reduction_right1_stem_2/depthwise_kernel:0[FLOAT, 22x1x7x7]
  %W139[FLOAT, 22x22x1x1]
  %scale171[FLOAT, 22]
  %bias171[FLOAT, 22]
  %mean171[FLOAT, 22]
  %var171[FLOAT, 22]
  %reduction_A_block_stem_2_1/block_2/separable_conv_block_reduction_right2_stem_2/separable_conv_1_reduction_right2_stem_2/depthwise_kernel:0[FLOAT, 22x1x7x7]
  %W140[FLOAT, 22x22x1x1]
  %reduction_A_block_stem_2_1/block_3/separable_conv_block_reduction_right3_stem_2/separable_conv_1_reduction_right3_stem_2/depthwise_kernel:0[FLOAT, 22x1x5x5]
  %W141[FLOAT, 22x22x1x1]
  %reduction_A_block_stem_2_1/block_5/separable_conv_block_reduction_left4_stem_2/separable_conv_1_reduction_left4_stem_2/depthwise_kernel:0[FLOAT, 22x1x3x3]
  %W142[FLOAT, 22x22x1x1]
  %normal_A_block_0_1/adjust_block/adjust_reduction_block_0/zero_padding2d_12/Pad:0_cropping_start[INT64, 4]
  %normal_A_block_0_1/adjust_block/adjust_reduction_block_0/zero_padding2d_12/Pad:0_cropping_end[INT64, 4]
  %normal_A_block_0_1/adjust_block/adjust_reduction_block_0/zero_padding2d_12/Pad:0_cropping_axes[INT64, 4]
  %scale172[FLOAT, 44]
  %bias172[FLOAT, 44]
  %mean172[FLOAT, 44]
  %var172[FLOAT, 44]
  %scale173[FLOAT, 44]
  %bias173[FLOAT, 44]
  %mean173[FLOAT, 44]
  %var173[FLOAT, 44]
  %scale174[FLOAT, 44]
  %bias174[FLOAT, 44]
  %mean174[FLOAT, 44]
  %var174[FLOAT, 44]
  %scale175[FLOAT, 44]
  %bias175[FLOAT, 44]
  %mean175[FLOAT, 44]
  %var175[FLOAT, 44]
  %scale176[FLOAT, 44]
  %bias176[FLOAT, 44]
  %mean176[FLOAT, 44]
  %var176[FLOAT, 44]
  %Pad13_pads[INT64, 8]
  %Pad13_value[FLOAT, scalar]
  %Pad14_pads[INT64, 8]
  %Pad14_value[FLOAT, scalar]
  %scale177[FLOAT, 22]
  %bias177[FLOAT, 22]
  %mean177[FLOAT, 22]
  %var177[FLOAT, 22]
  %scale178[FLOAT, 22]
  %bias178[FLOAT, 22]
  %mean178[FLOAT, 22]
  %var178[FLOAT, 22]
  %Pad15_pads[INT64, 8]
  %Pad15_value[FLOAT, scalar]
  %normal_A_block_0_1/block_1/separable_conv_block_normal_left1_0/separable_conv_1_normal_left1_0/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W143[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_1/separable_conv_block_normal_right1_0/separable_conv_1_normal_right1_0/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W144[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_2/separable_conv_block_normal_left2_0/separable_conv_1_normal_left2_0/depthwise_kernel:0[FLOAT, 44x1x5x5]
  %W145[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_2/separable_conv_block_normal_right2_0/separable_conv_1_normal_right2_0/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W146[FLOAT, 44x44x1x1]
  %normal_A_block_0_1/block_5/separable_conv_block_normal_left5_0/separable_conv_1_normal_left5_0/depthwise_kernel:0[FLOAT, 44x1x3x3]
  %W147[FLOAT, 44x44x1x1]
  %reduction_A_block_stem_2_1/block_1/separable_conv_block_reduction_left1_stem_2/separable_conv_1_reduction_left1_stem_2/depthwise_kernel:0[FLOAT, 22x1x5x5]
  %W148[FLOAT, 22x22x1x1]
  %reduction_A_block_stem_2_1/block_1/separable_conv_block_reduction_right1_stem_2/separable_conv_1_reduction_right1_stem_2/depthwise_kernel:0[FLOAT, 22x1x7x7]
  %W149[FLOAT, 22x22x1x1]
  %scale179[FLOAT, 11]
  %bias179[FLOAT, 11]
  %mean179[FLOAT, 11]
  %var179[FLOAT, 11]
  %scale180[FLOAT, 11]
  %bias180[FLOAT, 11]
  %mean180[FLOAT, 11]
  %var180[FLOAT, 11]
  %scale181[FLOAT, 11]
  %bias181[FLOAT, 11]
  %mean181[FLOAT, 11]
  %var181[FLOAT, 11]
  %scale182[FLOAT, 22]
  %bias182[FLOAT, 22]
  %mean182[FLOAT, 22]
  %var182[FLOAT, 22]
  %Pad16_pads[INT64, 8]
  %Pad16_value[FLOAT, scalar]
  %Pad17_pads[INT64, 8]
  %Pad17_value[FLOAT, scalar]
  %Pad18_pads[INT64, 8]
  %Pad18_value[FLOAT, scalar]
  %reduction_A_block_stem_1_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_2_reduction_right2_stem_1/depthwise_kernel:0[FLOAT, 11x1x7x7]
  %W150[FLOAT, 11x11x1x1]
  %reduction_A_block_stem_1_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_2_reduction_right3_stem_1/depthwise_kernel:0[FLOAT, 11x1x5x5]
  %W151[FLOAT, 11x11x1x1]
  %reduction_A_block_stem_1_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_2_reduction_left4_stem_1/depthwise_kernel:0[FLOAT, 11x1x3x3]
  %W152[FLOAT, 11x11x1x1]
  %scale183[FLOAT, 11]
  %bias183[FLOAT, 11]
  %mean183[FLOAT, 11]
  %var183[FLOAT, 11]
  %scale184[FLOAT, 11]
  %bias184[FLOAT, 11]
  %mean184[FLOAT, 11]
  %var184[FLOAT, 11]
  %scale185[FLOAT, 11]
  %bias185[FLOAT, 11]
  %mean185[FLOAT, 11]
  %var185[FLOAT, 11]
  %reduction_A_block_stem_2_1/adjust_block/adjust_reduction_block_stem_2/adjust_conv_1_stem_2/kernel:0[FLOAT, 11x32x1x1]
  %reduction_A_block_stem_2_1/adjust_block/adjust_reduction_block_stem_2/adjust_conv_2_stem_2/kernel:0[FLOAT, 11x32x1x1]
  %reduction_A_block_stem_1_1/reduction_conv_1_stem_1/kernel:0[FLOAT, 11x32x1x1]
  %scale186[FLOAT, 11]
  %bias186[FLOAT, 11]
  %mean186[FLOAT, 11]
  %var186[FLOAT, 11]
  %scale187[FLOAT, 11]
  %bias187[FLOAT, 11]
  %mean187[FLOAT, 11]
  %var187[FLOAT, 11]
  %reduction_A_block_stem_1_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_2_reduction_left1_stem_1/depthwise_kernel:0[FLOAT, 11x1x5x5]
  %W153[FLOAT, 11x11x1x1]
  %reduction_A_block_stem_1_1/block_1/separable_conv_block_reduction_right1_stem_1/separable_conv_2_reduction_right1_stem_1/depthwise_kernel:0[FLOAT, 11x1x7x7]
  %W154[FLOAT, 11x11x1x1]
  %scale188[FLOAT, 11]
  %bias188[FLOAT, 11]
  %mean188[FLOAT, 11]
  %var188[FLOAT, 11]
  %reduction_A_block_stem_1_1/block_2/separable_conv_block_reduction_right2_stem_1/separable_conv_1_reduction_right2_stem_1/depthwise_kernel:0[FLOAT, 32x1x7x7]
  %W155[FLOAT, 11x32x1x1]
  %reduction_A_block_stem_1_1/block_3/separable_conv_block_reduction_right3_stem_1/separable_conv_1_reduction_right3_stem_1/depthwise_kernel:0[FLOAT, 32x1x5x5]
  %W156[FLOAT, 11x32x1x1]
  %reduction_A_block_stem_1_1/block_5/separable_conv_block_reduction_left4_stem_1/separable_conv_1_reduction_left4_stem_1/depthwise_kernel:0[FLOAT, 11x1x3x3]
  %W157[FLOAT, 11x11x1x1]
  %reduction_A_block_stem_2_1/adjust_block/adjust_reduction_block_stem_2/zero_padding2d_11/Pad:0_cropping_start[INT64, 4]
  %reduction_A_block_stem_2_1/adjust_block/adjust_reduction_block_stem_2/zero_padding2d_11/Pad:0_cropping_end[INT64, 4]
  %reduction_A_block_stem_2_1/adjust_block/adjust_reduction_block_stem_2/zero_padding2d_11/Pad:0_cropping_axes[INT64, 4]
  %scale189[FLOAT, 32]
  %bias189[FLOAT, 32]
  %mean189[FLOAT, 32]
  %var189[FLOAT, 32]
  %Pad19_pads[INT64, 8]
  %Pad19_value[FLOAT, scalar]
  %Pad20_pads[INT64, 8]
  %Pad20_value[FLOAT, scalar]
  %scale190[FLOAT, 11]
  %bias190[FLOAT, 11]
  %mean190[FLOAT, 11]
  %var190[FLOAT, 11]
  %scale191[FLOAT, 11]
  %bias191[FLOAT, 11]
  %mean191[FLOAT, 11]
  %var191[FLOAT, 11]
  %Pad21_pads[INT64, 8]
  %Pad21_value[FLOAT, scalar]
  %stem_conv1_1/kernel:0[FLOAT, 32x3x3x3]
  %reduction_A_block_stem_1_1/block_1/separable_conv_block_reduction_left1_stem_1/separable_conv_1_reduction_left1_stem_1/depthwise_kernel:0[FLOAT, 11x1x5x5]
  %W158[FLOAT, 11x11x1x1]
  %reduction_A_block_stem_1_1/block_1/separable_conv_block_reduction_right1_stem_1/separable_conv_1_reduction_right1_stem_1/depthwise_kernel:0[FLOAT, 32x1x7x7]
  %W159[FLOAT, 11x32x1x1]
  %Pad22_pads[INT64, 8]
  %Pad22_value[FLOAT, scalar]
  %Pad23_pads[INT64, 8]
  %Pad23_value[FLOAT, scalar]
) {
  %adjusted_input193 = Transpose[perm = [0, 3, 1, 2]](%input_15)
