graph resnet152v2 (
  %input_1[FLOAT, Nx244x244x3]
) initializers (
  %probs/kernel:0[FLOAT, 2048x1000]
  %probs/bias:0[FLOAT, 1000]
  %post_relu/Relu:0_reshape_start[INT64, 2]
  %scale[FLOAT, 2048]
  %bias[FLOAT, 2048]
  %mean[FLOAT, 2048]
  %var[FLOAT, 2048]
  %conv5_block3_3_conv/kernel:0[FLOAT, 2048x512x1x1]
  %conv5_block3_3_conv/bias:0[FLOAT, 2048]
  %conv5_block2_3_conv/kernel:0[FLOAT, 2048x512x1x1]
  %conv5_block2_3_conv/bias:0[FLOAT, 2048]
  %conv5_block1_0_conv/kernel:0[FLOAT, 2048x1024x1x1]
  %conv5_block1_0_conv/bias:0[FLOAT, 2048]
  %conv5_block1_3_conv/kernel:0[FLOAT, 2048x512x1x1]
  %conv5_block1_3_conv/bias:0[FLOAT, 2048]
  %scale1[FLOAT, 512]
  %bias1[FLOAT, 512]
  %mean1[FLOAT, 512]
  %var1[FLOAT, 512]
  %scale2[FLOAT, 512]
  %bias2[FLOAT, 512]
  %mean2[FLOAT, 512]
  %var2[FLOAT, 512]
  %conv5_block3_2_conv/kernel:0[FLOAT, 512x512x3x3]
  %scale3[FLOAT, 1024]
  %bias3[FLOAT, 1024]
  %mean3[FLOAT, 1024]
  %var3[FLOAT, 1024]
  %scale4[FLOAT, 512]
  %bias4[FLOAT, 512]
  %mean4[FLOAT, 512]
  %var4[FLOAT, 512]
  %conv5_block2_2_conv/kernel:0[FLOAT, 512x512x3x3]
  %Pad_pads[INT64, 8]
  %Pad_value[FLOAT, scalar]
  %conv5_block1_2_conv/kernel:0[FLOAT, 512x512x3x3]
  %Pad1_pads[INT64, 8]
  %Pad1_value[FLOAT, scalar]
  %conv4_block36_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block36_3_conv/bias:0[FLOAT, 1024]
  %Pad2_pads[INT64, 8]
  %Pad2_value[FLOAT, scalar]
  %scale5[FLOAT, 512]
  %bias5[FLOAT, 512]
  %mean5[FLOAT, 512]
  %var5[FLOAT, 512]
  %scale6[FLOAT, 512]
  %bias6[FLOAT, 512]
  %mean6[FLOAT, 512]
  %var6[FLOAT, 512]
  %conv5_block3_1_conv/kernel:0[FLOAT, 512x2048x1x1]
  %conv4_block35_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block35_3_conv/bias:0[FLOAT, 1024]
  %scale7[FLOAT, 256]
  %bias7[FLOAT, 256]
  %mean7[FLOAT, 256]
  %var7[FLOAT, 256]
  %scale8[FLOAT, 512]
  %bias8[FLOAT, 512]
  %mean8[FLOAT, 512]
  %var8[FLOAT, 512]
  %conv5_block2_1_conv/kernel:0[FLOAT, 512x2048x1x1]
  %conv4_block34_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block34_3_conv/bias:0[FLOAT, 1024]
  %conv4_block36_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %conv5_block1_1_conv/kernel:0[FLOAT, 512x1024x1x1]
  %scale9[FLOAT, 2048]
  %bias9[FLOAT, 2048]
  %mean9[FLOAT, 2048]
  %var9[FLOAT, 2048]
  %conv4_block33_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block33_3_conv/bias:0[FLOAT, 1024]
  %scale10[FLOAT, 256]
  %bias10[FLOAT, 256]
  %mean10[FLOAT, 256]
  %var10[FLOAT, 256]
  %Pad3_pads[INT64, 8]
  %Pad3_value[FLOAT, scalar]
  %scale11[FLOAT, 2048]
  %bias11[FLOAT, 2048]
  %mean11[FLOAT, 2048]
  %var11[FLOAT, 2048]
  %conv4_block32_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block32_3_conv/bias:0[FLOAT, 1024]
  %scale12[FLOAT, 256]
  %bias12[FLOAT, 256]
  %mean12[FLOAT, 256]
  %var12[FLOAT, 256]
  %conv4_block35_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %conv4_block31_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block31_3_conv/bias:0[FLOAT, 1024]
  %scale13[FLOAT, 256]
  %bias13[FLOAT, 256]
  %mean13[FLOAT, 256]
  %var13[FLOAT, 256]
  %conv4_block34_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad4_pads[INT64, 8]
  %Pad4_value[FLOAT, scalar]
  %scale14[FLOAT, 256]
  %bias14[FLOAT, 256]
  %mean14[FLOAT, 256]
  %var14[FLOAT, 256]
  %conv4_block30_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block30_3_conv/bias:0[FLOAT, 1024]
  %scale15[FLOAT, 256]
  %bias15[FLOAT, 256]
  %mean15[FLOAT, 256]
  %var15[FLOAT, 256]
  %conv4_block33_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad5_pads[INT64, 8]
  %Pad5_value[FLOAT, scalar]
  %conv4_block36_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %conv4_block29_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block29_3_conv/bias:0[FLOAT, 1024]
  %scale16[FLOAT, 256]
  %bias16[FLOAT, 256]
  %mean16[FLOAT, 256]
  %var16[FLOAT, 256]
  %conv4_block32_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad6_pads[INT64, 8]
  %Pad6_value[FLOAT, scalar]
  %scale17[FLOAT, 256]
  %bias17[FLOAT, 256]
  %mean17[FLOAT, 256]
  %var17[FLOAT, 256]
  %conv4_block28_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block28_3_conv/bias:0[FLOAT, 1024]
  %scale18[FLOAT, 256]
  %bias18[FLOAT, 256]
  %mean18[FLOAT, 256]
  %var18[FLOAT, 256]
  %conv4_block31_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad7_pads[INT64, 8]
  %Pad7_value[FLOAT, scalar]
  %scale19[FLOAT, 256]
  %bias19[FLOAT, 256]
  %mean19[FLOAT, 256]
  %var19[FLOAT, 256]
  %conv4_block35_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale20[FLOAT, 1024]
  %bias20[FLOAT, 1024]
  %mean20[FLOAT, 1024]
  %var20[FLOAT, 1024]
  %conv4_block27_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block27_3_conv/bias:0[FLOAT, 1024]
  %scale21[FLOAT, 256]
  %bias21[FLOAT, 256]
  %mean21[FLOAT, 256]
  %var21[FLOAT, 256]
  %conv4_block30_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad8_pads[INT64, 8]
  %Pad8_value[FLOAT, scalar]
  %scale22[FLOAT, 256]
  %bias22[FLOAT, 256]
  %mean22[FLOAT, 256]
  %var22[FLOAT, 256]
  %conv4_block34_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %conv4_block26_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block26_3_conv/bias:0[FLOAT, 1024]
  %scale23[FLOAT, 256]
  %bias23[FLOAT, 256]
  %mean23[FLOAT, 256]
  %var23[FLOAT, 256]
  %conv4_block29_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad9_pads[INT64, 8]
  %Pad9_value[FLOAT, scalar]
  %scale24[FLOAT, 256]
  %bias24[FLOAT, 256]
  %mean24[FLOAT, 256]
  %var24[FLOAT, 256]
  %conv4_block33_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale25[FLOAT, 1024]
  %bias25[FLOAT, 1024]
  %mean25[FLOAT, 1024]
  %var25[FLOAT, 1024]
  %conv4_block25_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block25_3_conv/bias:0[FLOAT, 1024]
  %scale26[FLOAT, 256]
  %bias26[FLOAT, 256]
  %mean26[FLOAT, 256]
  %var26[FLOAT, 256]
  %conv4_block28_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad10_pads[INT64, 8]
  %Pad10_value[FLOAT, scalar]
  %scale27[FLOAT, 256]
  %bias27[FLOAT, 256]
  %mean27[FLOAT, 256]
  %var27[FLOAT, 256]
  %conv4_block32_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale28[FLOAT, 1024]
  %bias28[FLOAT, 1024]
  %mean28[FLOAT, 1024]
  %var28[FLOAT, 1024]
  %conv4_block24_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block24_3_conv/bias:0[FLOAT, 1024]
  %scale29[FLOAT, 256]
  %bias29[FLOAT, 256]
  %mean29[FLOAT, 256]
  %var29[FLOAT, 256]
  %conv4_block27_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad11_pads[INT64, 8]
  %Pad11_value[FLOAT, scalar]
  %scale30[FLOAT, 256]
  %bias30[FLOAT, 256]
  %mean30[FLOAT, 256]
  %var30[FLOAT, 256]
  %conv4_block31_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale31[FLOAT, 1024]
  %bias31[FLOAT, 1024]
  %mean31[FLOAT, 1024]
  %var31[FLOAT, 1024]
  %conv4_block23_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block23_3_conv/bias:0[FLOAT, 1024]
  %scale32[FLOAT, 256]
  %bias32[FLOAT, 256]
  %mean32[FLOAT, 256]
  %var32[FLOAT, 256]
  %conv4_block26_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad12_pads[INT64, 8]
  %Pad12_value[FLOAT, scalar]
  %scale33[FLOAT, 256]
  %bias33[FLOAT, 256]
  %mean33[FLOAT, 256]
  %var33[FLOAT, 256]
  %conv4_block30_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale34[FLOAT, 1024]
  %bias34[FLOAT, 1024]
  %mean34[FLOAT, 1024]
  %var34[FLOAT, 1024]
  %conv4_block22_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block22_3_conv/bias:0[FLOAT, 1024]
  %scale35[FLOAT, 256]
  %bias35[FLOAT, 256]
  %mean35[FLOAT, 256]
  %var35[FLOAT, 256]
  %conv4_block25_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad13_pads[INT64, 8]
  %Pad13_value[FLOAT, scalar]
  %scale36[FLOAT, 256]
  %bias36[FLOAT, 256]
  %mean36[FLOAT, 256]
  %var36[FLOAT, 256]
  %conv4_block29_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale37[FLOAT, 1024]
  %bias37[FLOAT, 1024]
  %mean37[FLOAT, 1024]
  %var37[FLOAT, 1024]
  %conv4_block21_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block21_3_conv/bias:0[FLOAT, 1024]
  %scale38[FLOAT, 256]
  %bias38[FLOAT, 256]
  %mean38[FLOAT, 256]
  %var38[FLOAT, 256]
  %conv4_block24_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad14_pads[INT64, 8]
  %Pad14_value[FLOAT, scalar]
  %scale39[FLOAT, 256]
  %bias39[FLOAT, 256]
  %mean39[FLOAT, 256]
  %var39[FLOAT, 256]
  %conv4_block28_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale40[FLOAT, 1024]
  %bias40[FLOAT, 1024]
  %mean40[FLOAT, 1024]
  %var40[FLOAT, 1024]
  %conv4_block20_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block20_3_conv/bias:0[FLOAT, 1024]
  %scale41[FLOAT, 256]
  %bias41[FLOAT, 256]
  %mean41[FLOAT, 256]
  %var41[FLOAT, 256]
  %conv4_block23_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad15_pads[INT64, 8]
  %Pad15_value[FLOAT, scalar]
  %scale42[FLOAT, 256]
  %bias42[FLOAT, 256]
  %mean42[FLOAT, 256]
  %var42[FLOAT, 256]
  %conv4_block27_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale43[FLOAT, 1024]
  %bias43[FLOAT, 1024]
  %mean43[FLOAT, 1024]
  %var43[FLOAT, 1024]
  %conv4_block19_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block19_3_conv/bias:0[FLOAT, 1024]
  %scale44[FLOAT, 256]
  %bias44[FLOAT, 256]
  %mean44[FLOAT, 256]
  %var44[FLOAT, 256]
  %conv4_block22_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad16_pads[INT64, 8]
  %Pad16_value[FLOAT, scalar]
  %scale45[FLOAT, 256]
  %bias45[FLOAT, 256]
  %mean45[FLOAT, 256]
  %var45[FLOAT, 256]
  %conv4_block26_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale46[FLOAT, 1024]
  %bias46[FLOAT, 1024]
  %mean46[FLOAT, 1024]
  %var46[FLOAT, 1024]
  %conv4_block18_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block18_3_conv/bias:0[FLOAT, 1024]
  %scale47[FLOAT, 256]
  %bias47[FLOAT, 256]
  %mean47[FLOAT, 256]
  %var47[FLOAT, 256]
  %conv4_block21_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad17_pads[INT64, 8]
  %Pad17_value[FLOAT, scalar]
  %scale48[FLOAT, 256]
  %bias48[FLOAT, 256]
  %mean48[FLOAT, 256]
  %var48[FLOAT, 256]
  %conv4_block25_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale49[FLOAT, 1024]
  %bias49[FLOAT, 1024]
  %mean49[FLOAT, 1024]
  %var49[FLOAT, 1024]
  %conv4_block17_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block17_3_conv/bias:0[FLOAT, 1024]
  %scale50[FLOAT, 256]
  %bias50[FLOAT, 256]
  %mean50[FLOAT, 256]
  %var50[FLOAT, 256]
  %conv4_block20_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad18_pads[INT64, 8]
  %Pad18_value[FLOAT, scalar]
  %scale51[FLOAT, 256]
  %bias51[FLOAT, 256]
  %mean51[FLOAT, 256]
  %var51[FLOAT, 256]
  %conv4_block24_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale52[FLOAT, 1024]
  %bias52[FLOAT, 1024]
  %mean52[FLOAT, 1024]
  %var52[FLOAT, 1024]
  %conv4_block16_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block16_3_conv/bias:0[FLOAT, 1024]
  %scale53[FLOAT, 256]
  %bias53[FLOAT, 256]
  %mean53[FLOAT, 256]
  %var53[FLOAT, 256]
  %conv4_block19_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad19_pads[INT64, 8]
  %Pad19_value[FLOAT, scalar]
  %scale54[FLOAT, 256]
  %bias54[FLOAT, 256]
  %mean54[FLOAT, 256]
  %var54[FLOAT, 256]
  %conv4_block23_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale55[FLOAT, 1024]
  %bias55[FLOAT, 1024]
  %mean55[FLOAT, 1024]
  %var55[FLOAT, 1024]
  %conv4_block15_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block15_3_conv/bias:0[FLOAT, 1024]
  %scale56[FLOAT, 256]
  %bias56[FLOAT, 256]
  %mean56[FLOAT, 256]
  %var56[FLOAT, 256]
  %conv4_block18_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad20_pads[INT64, 8]
  %Pad20_value[FLOAT, scalar]
  %scale57[FLOAT, 256]
  %bias57[FLOAT, 256]
  %mean57[FLOAT, 256]
  %var57[FLOAT, 256]
  %conv4_block22_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale58[FLOAT, 1024]
  %bias58[FLOAT, 1024]
  %mean58[FLOAT, 1024]
  %var58[FLOAT, 1024]
  %conv4_block14_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block14_3_conv/bias:0[FLOAT, 1024]
  %scale59[FLOAT, 256]
  %bias59[FLOAT, 256]
  %mean59[FLOAT, 256]
  %var59[FLOAT, 256]
  %conv4_block17_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad21_pads[INT64, 8]
  %Pad21_value[FLOAT, scalar]
  %scale60[FLOAT, 256]
  %bias60[FLOAT, 256]
  %mean60[FLOAT, 256]
  %var60[FLOAT, 256]
  %conv4_block21_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale61[FLOAT, 1024]
  %bias61[FLOAT, 1024]
  %mean61[FLOAT, 1024]
  %var61[FLOAT, 1024]
  %conv4_block13_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block13_3_conv/bias:0[FLOAT, 1024]
  %scale62[FLOAT, 256]
  %bias62[FLOAT, 256]
  %mean62[FLOAT, 256]
  %var62[FLOAT, 256]
  %conv4_block16_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad22_pads[INT64, 8]
  %Pad22_value[FLOAT, scalar]
  %scale63[FLOAT, 256]
  %bias63[FLOAT, 256]
  %mean63[FLOAT, 256]
  %var63[FLOAT, 256]
  %conv4_block20_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale64[FLOAT, 1024]
  %bias64[FLOAT, 1024]
  %mean64[FLOAT, 1024]
  %var64[FLOAT, 1024]
  %conv4_block12_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block12_3_conv/bias:0[FLOAT, 1024]
  %scale65[FLOAT, 256]
  %bias65[FLOAT, 256]
  %mean65[FLOAT, 256]
  %var65[FLOAT, 256]
  %conv4_block15_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad23_pads[INT64, 8]
  %Pad23_value[FLOAT, scalar]
  %scale66[FLOAT, 256]
  %bias66[FLOAT, 256]
  %mean66[FLOAT, 256]
  %var66[FLOAT, 256]
  %conv4_block19_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale67[FLOAT, 1024]
  %bias67[FLOAT, 1024]
  %mean67[FLOAT, 1024]
  %var67[FLOAT, 1024]
  %conv4_block11_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block11_3_conv/bias:0[FLOAT, 1024]
  %scale68[FLOAT, 256]
  %bias68[FLOAT, 256]
  %mean68[FLOAT, 256]
  %var68[FLOAT, 256]
  %conv4_block14_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad24_pads[INT64, 8]
  %Pad24_value[FLOAT, scalar]
  %scale69[FLOAT, 256]
  %bias69[FLOAT, 256]
  %mean69[FLOAT, 256]
  %var69[FLOAT, 256]
  %conv4_block18_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale70[FLOAT, 1024]
  %bias70[FLOAT, 1024]
  %mean70[FLOAT, 1024]
  %var70[FLOAT, 1024]
  %conv4_block10_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block10_3_conv/bias:0[FLOAT, 1024]
  %scale71[FLOAT, 256]
  %bias71[FLOAT, 256]
  %mean71[FLOAT, 256]
  %var71[FLOAT, 256]
  %conv4_block13_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad25_pads[INT64, 8]
  %Pad25_value[FLOAT, scalar]
  %scale72[FLOAT, 256]
  %bias72[FLOAT, 256]
  %mean72[FLOAT, 256]
  %var72[FLOAT, 256]
  %conv4_block17_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale73[FLOAT, 1024]
  %bias73[FLOAT, 1024]
  %mean73[FLOAT, 1024]
  %var73[FLOAT, 1024]
  %conv4_block9_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block9_3_conv/bias:0[FLOAT, 1024]
  %scale74[FLOAT, 256]
  %bias74[FLOAT, 256]
  %mean74[FLOAT, 256]
  %var74[FLOAT, 256]
  %conv4_block12_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad26_pads[INT64, 8]
  %Pad26_value[FLOAT, scalar]
  %scale75[FLOAT, 256]
  %bias75[FLOAT, 256]
  %mean75[FLOAT, 256]
  %var75[FLOAT, 256]
  %conv4_block16_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale76[FLOAT, 1024]
  %bias76[FLOAT, 1024]
  %mean76[FLOAT, 1024]
  %var76[FLOAT, 1024]
  %conv4_block8_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block8_3_conv/bias:0[FLOAT, 1024]
  %scale77[FLOAT, 256]
  %bias77[FLOAT, 256]
  %mean77[FLOAT, 256]
  %var77[FLOAT, 256]
  %conv4_block11_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad27_pads[INT64, 8]
  %Pad27_value[FLOAT, scalar]
  %scale78[FLOAT, 256]
  %bias78[FLOAT, 256]
  %mean78[FLOAT, 256]
  %var78[FLOAT, 256]
  %conv4_block15_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale79[FLOAT, 1024]
  %bias79[FLOAT, 1024]
  %mean79[FLOAT, 1024]
  %var79[FLOAT, 1024]
  %conv4_block7_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block7_3_conv/bias:0[FLOAT, 1024]
  %scale80[FLOAT, 256]
  %bias80[FLOAT, 256]
  %mean80[FLOAT, 256]
  %var80[FLOAT, 256]
  %conv4_block10_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad28_pads[INT64, 8]
  %Pad28_value[FLOAT, scalar]
  %scale81[FLOAT, 256]
  %bias81[FLOAT, 256]
  %mean81[FLOAT, 256]
  %var81[FLOAT, 256]
  %conv4_block14_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale82[FLOAT, 1024]
  %bias82[FLOAT, 1024]
  %mean82[FLOAT, 1024]
  %var82[FLOAT, 1024]
  %conv4_block6_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block6_3_conv/bias:0[FLOAT, 1024]
  %scale83[FLOAT, 256]
  %bias83[FLOAT, 256]
  %mean83[FLOAT, 256]
  %var83[FLOAT, 256]
  %conv4_block9_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad29_pads[INT64, 8]
  %Pad29_value[FLOAT, scalar]
  %scale84[FLOAT, 256]
  %bias84[FLOAT, 256]
  %mean84[FLOAT, 256]
  %var84[FLOAT, 256]
  %conv4_block13_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale85[FLOAT, 1024]
  %bias85[FLOAT, 1024]
  %mean85[FLOAT, 1024]
  %var85[FLOAT, 1024]
  %conv4_block5_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block5_3_conv/bias:0[FLOAT, 1024]
  %scale86[FLOAT, 256]
  %bias86[FLOAT, 256]
  %mean86[FLOAT, 256]
  %var86[FLOAT, 256]
  %conv4_block8_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad30_pads[INT64, 8]
  %Pad30_value[FLOAT, scalar]
  %scale87[FLOAT, 256]
  %bias87[FLOAT, 256]
  %mean87[FLOAT, 256]
  %var87[FLOAT, 256]
  %conv4_block12_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale88[FLOAT, 1024]
  %bias88[FLOAT, 1024]
  %mean88[FLOAT, 1024]
  %var88[FLOAT, 1024]
  %conv4_block4_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block4_3_conv/bias:0[FLOAT, 1024]
  %scale89[FLOAT, 256]
  %bias89[FLOAT, 256]
  %mean89[FLOAT, 256]
  %var89[FLOAT, 256]
  %conv4_block7_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad31_pads[INT64, 8]
  %Pad31_value[FLOAT, scalar]
  %scale90[FLOAT, 256]
  %bias90[FLOAT, 256]
  %mean90[FLOAT, 256]
  %var90[FLOAT, 256]
  %conv4_block11_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale91[FLOAT, 1024]
  %bias91[FLOAT, 1024]
  %mean91[FLOAT, 1024]
  %var91[FLOAT, 1024]
  %conv4_block3_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block3_3_conv/bias:0[FLOAT, 1024]
  %scale92[FLOAT, 256]
  %bias92[FLOAT, 256]
  %mean92[FLOAT, 256]
  %var92[FLOAT, 256]
  %conv4_block6_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad32_pads[INT64, 8]
  %Pad32_value[FLOAT, scalar]
  %scale93[FLOAT, 256]
  %bias93[FLOAT, 256]
  %mean93[FLOAT, 256]
  %var93[FLOAT, 256]
  %conv4_block10_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale94[FLOAT, 1024]
  %bias94[FLOAT, 1024]
  %mean94[FLOAT, 1024]
  %var94[FLOAT, 1024]
  %conv4_block2_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block2_3_conv/bias:0[FLOAT, 1024]
  %scale95[FLOAT, 256]
  %bias95[FLOAT, 256]
  %mean95[FLOAT, 256]
  %var95[FLOAT, 256]
  %conv4_block5_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad33_pads[INT64, 8]
  %Pad33_value[FLOAT, scalar]
  %scale96[FLOAT, 256]
  %bias96[FLOAT, 256]
  %mean96[FLOAT, 256]
  %var96[FLOAT, 256]
  %conv4_block9_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale97[FLOAT, 1024]
  %bias97[FLOAT, 1024]
  %mean97[FLOAT, 1024]
  %var97[FLOAT, 1024]
  %conv4_block1_0_conv/kernel:0[FLOAT, 1024x512x1x1]
  %conv4_block1_0_conv/bias:0[FLOAT, 1024]
  %conv4_block1_3_conv/kernel:0[FLOAT, 1024x256x1x1]
  %conv4_block1_3_conv/bias:0[FLOAT, 1024]
  %scale98[FLOAT, 256]
  %bias98[FLOAT, 256]
  %mean98[FLOAT, 256]
  %var98[FLOAT, 256]
  %conv4_block4_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad34_pads[INT64, 8]
  %Pad34_value[FLOAT, scalar]
  %scale99[FLOAT, 256]
  %bias99[FLOAT, 256]
  %mean99[FLOAT, 256]
  %var99[FLOAT, 256]
  %conv4_block8_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale100[FLOAT, 1024]
  %bias100[FLOAT, 1024]
  %mean100[FLOAT, 1024]
  %var100[FLOAT, 1024]
  %scale101[FLOAT, 256]
  %bias101[FLOAT, 256]
  %mean101[FLOAT, 256]
  %var101[FLOAT, 256]
  %conv4_block3_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad35_pads[INT64, 8]
  %Pad35_value[FLOAT, scalar]
  %scale102[FLOAT, 256]
  %bias102[FLOAT, 256]
  %mean102[FLOAT, 256]
  %var102[FLOAT, 256]
  %conv4_block7_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale103[FLOAT, 1024]
  %bias103[FLOAT, 1024]
  %mean103[FLOAT, 1024]
  %var103[FLOAT, 1024]
  %scale104[FLOAT, 512]
  %bias104[FLOAT, 512]
  %mean104[FLOAT, 512]
  %var104[FLOAT, 512]
  %scale105[FLOAT, 256]
  %bias105[FLOAT, 256]
  %mean105[FLOAT, 256]
  %var105[FLOAT, 256]
  %conv4_block2_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad36_pads[INT64, 8]
  %Pad36_value[FLOAT, scalar]
  %scale106[FLOAT, 256]
  %bias106[FLOAT, 256]
  %mean106[FLOAT, 256]
  %var106[FLOAT, 256]
  %conv4_block6_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale107[FLOAT, 1024]
  %bias107[FLOAT, 1024]
  %mean107[FLOAT, 1024]
  %var107[FLOAT, 1024]
  %conv4_block1_2_conv/kernel:0[FLOAT, 256x256x3x3]
  %Pad37_pads[INT64, 8]
  %Pad37_value[FLOAT, scalar]
  %scale108[FLOAT, 256]
  %bias108[FLOAT, 256]
  %mean108[FLOAT, 256]
  %var108[FLOAT, 256]
  %conv4_block5_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale109[FLOAT, 1024]
  %bias109[FLOAT, 1024]
  %mean109[FLOAT, 1024]
  %var109[FLOAT, 1024]
  %conv3_block8_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block8_3_conv/bias:0[FLOAT, 512]
  %Pad38_pads[INT64, 8]
  %Pad38_value[FLOAT, scalar]
  %scale110[FLOAT, 256]
  %bias110[FLOAT, 256]
  %mean110[FLOAT, 256]
  %var110[FLOAT, 256]
  %conv4_block4_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale111[FLOAT, 1024]
  %bias111[FLOAT, 1024]
  %mean111[FLOAT, 1024]
  %var111[FLOAT, 1024]
  %scale112[FLOAT, 256]
  %bias112[FLOAT, 256]
  %mean112[FLOAT, 256]
  %var112[FLOAT, 256]
  %conv4_block3_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale113[FLOAT, 1024]
  %bias113[FLOAT, 1024]
  %mean113[FLOAT, 1024]
  %var113[FLOAT, 1024]
  %conv3_block7_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block7_3_conv/bias:0[FLOAT, 512]
  %scale114[FLOAT, 128]
  %bias114[FLOAT, 128]
  %mean114[FLOAT, 128]
  %var114[FLOAT, 128]
  %scale115[FLOAT, 256]
  %bias115[FLOAT, 256]
  %mean115[FLOAT, 256]
  %var115[FLOAT, 256]
  %conv4_block2_1_conv/kernel:0[FLOAT, 256x1024x1x1]
  %scale116[FLOAT, 1024]
  %bias116[FLOAT, 1024]
  %mean116[FLOAT, 1024]
  %var116[FLOAT, 1024]
  %conv3_block6_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block6_3_conv/bias:0[FLOAT, 512]
  %conv3_block8_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %conv4_block1_1_conv/kernel:0[FLOAT, 256x512x1x1]
  %scale117[FLOAT, 1024]
  %bias117[FLOAT, 1024]
  %mean117[FLOAT, 1024]
  %var117[FLOAT, 1024]
  %conv3_block5_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block5_3_conv/bias:0[FLOAT, 512]
  %scale118[FLOAT, 128]
  %bias118[FLOAT, 128]
  %mean118[FLOAT, 128]
  %var118[FLOAT, 128]
  %Pad39_pads[INT64, 8]
  %Pad39_value[FLOAT, scalar]
  %scale119[FLOAT, 1024]
  %bias119[FLOAT, 1024]
  %mean119[FLOAT, 1024]
  %var119[FLOAT, 1024]
  %conv3_block4_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block4_3_conv/bias:0[FLOAT, 512]
  %scale120[FLOAT, 128]
  %bias120[FLOAT, 128]
  %mean120[FLOAT, 128]
  %var120[FLOAT, 128]
  %conv3_block7_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %conv3_block3_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block3_3_conv/bias:0[FLOAT, 512]
  %scale121[FLOAT, 128]
  %bias121[FLOAT, 128]
  %mean121[FLOAT, 128]
  %var121[FLOAT, 128]
  %conv3_block6_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %Pad40_pads[INT64, 8]
  %Pad40_value[FLOAT, scalar]
  %scale122[FLOAT, 128]
  %bias122[FLOAT, 128]
  %mean122[FLOAT, 128]
  %var122[FLOAT, 128]
  %conv3_block2_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block2_3_conv/bias:0[FLOAT, 512]
  %scale123[FLOAT, 128]
  %bias123[FLOAT, 128]
  %mean123[FLOAT, 128]
  %var123[FLOAT, 128]
  %conv3_block5_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %Pad41_pads[INT64, 8]
  %Pad41_value[FLOAT, scalar]
  %conv3_block8_1_conv/kernel:0[FLOAT, 128x512x1x1]
  %conv3_block1_0_conv/kernel:0[FLOAT, 512x256x1x1]
  %conv3_block1_0_conv/bias:0[FLOAT, 512]
  %conv3_block1_3_conv/kernel:0[FLOAT, 512x128x1x1]
  %conv3_block1_3_conv/bias:0[FLOAT, 512]
  %scale124[FLOAT, 128]
  %bias124[FLOAT, 128]
  %mean124[FLOAT, 128]
  %var124[FLOAT, 128]
  %conv3_block4_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %Pad42_pads[INT64, 8]
  %Pad42_value[FLOAT, scalar]
  %scale125[FLOAT, 128]
  %bias125[FLOAT, 128]
  %mean125[FLOAT, 128]
  %var125[FLOAT, 128]
  %scale126[FLOAT, 128]
  %bias126[FLOAT, 128]
  %mean126[FLOAT, 128]
  %var126[FLOAT, 128]
  %conv3_block3_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %Pad43_pads[INT64, 8]
  %Pad43_value[FLOAT, scalar]
  %scale127[FLOAT, 128]
  %bias127[FLOAT, 128]
  %mean127[FLOAT, 128]
  %var127[FLOAT, 128]
  %conv3_block7_1_conv/kernel:0[FLOAT, 128x512x1x1]
  %scale128[FLOAT, 512]
  %bias128[FLOAT, 512]
  %mean128[FLOAT, 512]
  %var128[FLOAT, 512]
  %scale129[FLOAT, 256]
  %bias129[FLOAT, 256]
  %mean129[FLOAT, 256]
  %var129[FLOAT, 256]
  %scale130[FLOAT, 128]
  %bias130[FLOAT, 128]
  %mean130[FLOAT, 128]
  %var130[FLOAT, 128]
  %conv3_block2_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %Pad44_pads[INT64, 8]
  %Pad44_value[FLOAT, scalar]
  %scale131[FLOAT, 128]
  %bias131[FLOAT, 128]
  %mean131[FLOAT, 128]
  %var131[FLOAT, 128]
  %conv3_block6_1_conv/kernel:0[FLOAT, 128x512x1x1]
  %conv3_block1_2_conv/kernel:0[FLOAT, 128x128x3x3]
  %Pad45_pads[INT64, 8]
  %Pad45_value[FLOAT, scalar]
  %scale132[FLOAT, 128]
  %bias132[FLOAT, 128]
  %mean132[FLOAT, 128]
  %var132[FLOAT, 128]
  %conv3_block5_1_conv/kernel:0[FLOAT, 128x512x1x1]
  %scale133[FLOAT, 512]
  %bias133[FLOAT, 512]
  %mean133[FLOAT, 512]
  %var133[FLOAT, 512]
  %conv2_block3_3_conv/kernel:0[FLOAT, 256x64x1x1]
  %conv2_block3_3_conv/bias:0[FLOAT, 256]
  %Pad46_pads[INT64, 8]
  %Pad46_value[FLOAT, scalar]
  %scale134[FLOAT, 128]
  %bias134[FLOAT, 128]
  %mean134[FLOAT, 128]
  %var134[FLOAT, 128]
  %conv3_block4_1_conv/kernel:0[FLOAT, 128x512x1x1]
  %scale135[FLOAT, 512]
  %bias135[FLOAT, 512]
  %mean135[FLOAT, 512]
  %var135[FLOAT, 512]
  %scale136[FLOAT, 128]
  %bias136[FLOAT, 128]
  %mean136[FLOAT, 128]
  %var136[FLOAT, 128]
  %conv3_block3_1_conv/kernel:0[FLOAT, 128x512x1x1]
  %scale137[FLOAT, 512]
  %bias137[FLOAT, 512]
  %mean137[FLOAT, 512]
  %var137[FLOAT, 512]
  %conv2_block2_3_conv/kernel:0[FLOAT, 256x64x1x1]
  %conv2_block2_3_conv/bias:0[FLOAT, 256]
  %scale138[FLOAT, 64]
  %bias138[FLOAT, 64]
  %mean138[FLOAT, 64]
  %var138[FLOAT, 64]
  %scale139[FLOAT, 128]
  %bias139[FLOAT, 128]
  %mean139[FLOAT, 128]
  %var139[FLOAT, 128]
  %conv3_block2_1_conv/kernel:0[FLOAT, 128x512x1x1]
  %scale140[FLOAT, 512]
  %bias140[FLOAT, 512]
  %mean140[FLOAT, 512]
  %var140[FLOAT, 512]
  %conv2_block1_0_conv/kernel:0[FLOAT, 256x64x1x1]
  %conv2_block1_0_conv/bias:0[FLOAT, 256]
  %conv2_block1_3_conv/kernel:0[FLOAT, 256x64x1x1]
  %conv2_block1_3_conv/bias:0[FLOAT, 256]
  %conv2_block3_2_conv/kernel:0[FLOAT, 64x64x3x3]
  %conv3_block1_1_conv/kernel:0[FLOAT, 128x256x1x1]
  %scale141[FLOAT, 512]
  %bias141[FLOAT, 512]
  %mean141[FLOAT, 512]
  %var141[FLOAT, 512]
  %scale142[FLOAT, 64]
  %bias142[FLOAT, 64]
  %mean142[FLOAT, 64]
  %var142[FLOAT, 64]
  %Pad47_pads[INT64, 8]
  %Pad47_value[FLOAT, scalar]
  %scale143[FLOAT, 512]
  %bias143[FLOAT, 512]
  %mean143[FLOAT, 512]
  %var143[FLOAT, 512]
  %scale144[FLOAT, 64]
  %bias144[FLOAT, 64]
  %mean144[FLOAT, 64]
  %var144[FLOAT, 64]
  %scale145[FLOAT, 64]
  %bias145[FLOAT, 64]
  %mean145[FLOAT, 64]
  %var145[FLOAT, 64]
  %conv2_block2_2_conv/kernel:0[FLOAT, 64x64x3x3]
  %conv2_block1_2_conv/kernel:0[FLOAT, 64x64x3x3]
  %Pad48_pads[INT64, 8]
  %Pad48_value[FLOAT, scalar]
  %scale146[FLOAT, 64]
  %bias146[FLOAT, 64]
  %mean146[FLOAT, 64]
  %var146[FLOAT, 64]
  %Pad49_pads[INT64, 8]
  %Pad49_value[FLOAT, scalar]
  %Pad50_pads[INT64, 8]
  %Pad50_value[FLOAT, scalar]
  %conv2_block3_1_conv/kernel:0[FLOAT, 64x256x1x1]
  %conv1_conv/kernel:0[FLOAT, 64x3x7x7]
  %conv1_conv/bias:0[FLOAT, 64]
  %scale147[FLOAT, 64]
  %bias147[FLOAT, 64]
  %mean147[FLOAT, 64]
  %var147[FLOAT, 64]
  %Pad51_pads[INT64, 8]
  %Pad51_value[FLOAT, scalar]
  %scale148[FLOAT, 64]
  %bias148[FLOAT, 64]
  %mean148[FLOAT, 64]
  %var148[FLOAT, 64]
  %conv2_block2_1_conv/kernel:0[FLOAT, 64x256x1x1]
  %scale149[FLOAT, 256]
  %bias149[FLOAT, 256]
  %mean149[FLOAT, 256]
  %var149[FLOAT, 256]
  %conv2_block1_1_conv/kernel:0[FLOAT, 64x64x1x1]
  %scale150[FLOAT, 256]
  %bias150[FLOAT, 256]
  %mean150[FLOAT, 256]
  %var150[FLOAT, 256]
) {
  %input_1:01_permuted = Transpose[perm = [0, 3, 1, 2]](%input_1)
  %input_1:01_permuted_padded = Pad[mode = 'constant'](%input_1:01_permuted, %Pad51_pads, %Pad51_value)
  %convolution_output152 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [7, 7], strides = [2, 2]](%input_1:01_permuted_padded, %conv1_conv/kernel:0, %conv1_conv/bias:0)
  %conv1_conv/BiasAdd:0_permuted_padded = Pad[mode = 'constant'](%convolution_output152, %Pad49_pads, %Pad49_value)
  %pool1_pad/Pad:0_pooling0 = MaxPool[auto_pad = 'VALID', ceil_mode = 0, kernel_shape = [3, 3], strides = [2, 2]](%conv1_conv/BiasAdd:0_permuted_padded)
  %batch_norm_output_buffer144 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%pool1_pad/Pad:0_pooling0, %scale144, %bias144, %mean144, %var144)
  %conv2_block1_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer144)
  %convolution_output154 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv2_block1_preact_relu/Relu:0, %conv2_block1_1_conv/kernel:0)
  %batch_norm_output_buffer148 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output154, %scale148, %bias148, %mean148, %var148)
  %conv2_block1_1_relu/Relu:0 = Relu(%batch_norm_output_buffer148)
  %conv2_block1_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv2_block1_1_relu/Relu:0, %Pad50_pads, %Pad50_value)
  %convolution_output150 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv2_block1_1_relu/Relu:0_permuted_padded, %conv2_block1_2_conv/kernel:0)
  %batch_norm_output_buffer145 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output150, %scale145, %bias145, %mean145, %var145)
  %conv2_block1_2_relu/Relu:0 = Relu(%batch_norm_output_buffer145)
  %convolution_output146 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv2_block1_2_relu/Relu:0, %conv2_block1_3_conv/kernel:0, %conv2_block1_3_conv/bias:0)
  %convolution_output145 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv2_block1_preact_relu/Relu:0, %conv2_block1_0_conv/kernel:0, %conv2_block1_0_conv/bias:0)
  %conv2_block1_out/add:0 = Add(%convolution_output145, %convolution_output146)
  %batch_norm_output_buffer150 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv2_block1_out/add:0, %scale150, %bias150, %mean150, %var150)
  %conv2_block2_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer150)
  %convolution_output153 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv2_block2_preact_relu/Relu:0, %conv2_block2_1_conv/kernel:0)
  %batch_norm_output_buffer147 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output153, %scale147, %bias147, %mean147, %var147)
  %conv2_block2_1_relu/Relu:0 = Relu(%batch_norm_output_buffer147)
  %conv2_block2_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv2_block2_1_relu/Relu:0, %Pad48_pads, %Pad48_value)
  %convolution_output149 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv2_block2_1_relu/Relu:0_permuted_padded, %conv2_block2_2_conv/kernel:0)
  %batch_norm_output_buffer142 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output149, %scale142, %bias142, %mean142, %var142)
  %conv2_block2_2_relu/Relu:0 = Relu(%batch_norm_output_buffer142)
  %convolution_output143 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv2_block2_2_relu/Relu:0, %conv2_block2_3_conv/kernel:0, %conv2_block2_3_conv/bias:0)
  %conv2_block2_out/add:0 = Add(%conv2_block1_out/add:0, %convolution_output143)
  %batch_norm_output_buffer149 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv2_block2_out/add:0, %scale149, %bias149, %mean149, %var149)
  %conv2_block3_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer149)
  %convolution_output151 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv2_block3_preact_relu/Relu:0, %conv2_block3_1_conv/kernel:0)
  %batch_norm_output_buffer146 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output151, %scale146, %bias146, %mean146, %var146)
  %conv2_block3_1_relu/Relu:0 = Relu(%batch_norm_output_buffer146)
  %conv2_block3_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv2_block3_1_relu/Relu:0, %Pad47_pads, %Pad47_value)
  %convolution_output147 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [2, 2]](%conv2_block3_1_relu/Relu:0_permuted_padded, %conv2_block3_2_conv/kernel:0)
  %batch_norm_output_buffer138 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output147, %scale138, %bias138, %mean138, %var138)
  %conv2_block3_2_relu/Relu:0 = Relu(%batch_norm_output_buffer138)
  %convolution_output140 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv2_block3_2_relu/Relu:0, %conv2_block3_3_conv/kernel:0, %conv2_block3_3_conv/bias:0)
  %conv2_block2_out/add:0_pooling0 = MaxPool[auto_pad = 'VALID', ceil_mode = 0, kernel_shape = [1, 1], strides = [2, 2]](%conv2_block2_out/add:0)
  %conv2_block3_out/add:0 = Add(%conv2_block2_out/add:0_pooling0, %convolution_output140)
  %batch_norm_output_buffer129 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv2_block3_out/add:0, %scale129, %bias129, %mean129, %var129)
  %conv3_block1_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer129)
  %convolution_output148 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block1_preact_relu/Relu:0, %conv3_block1_1_conv/kernel:0)
  %batch_norm_output_buffer139 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output148, %scale139, %bias139, %mean139, %var139)
  %conv3_block1_1_relu/Relu:0 = Relu(%batch_norm_output_buffer139)
  %conv3_block1_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block1_1_relu/Relu:0, %Pad46_pads, %Pad46_value)
  %convolution_output138 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv3_block1_1_relu/Relu:0_permuted_padded, %conv3_block1_2_conv/kernel:0)
  %batch_norm_output_buffer130 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output138, %scale130, %bias130, %mean130, %var130)
  %conv3_block1_2_relu/Relu:0 = Relu(%batch_norm_output_buffer130)
  %convolution_output132 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block1_2_relu/Relu:0, %conv3_block1_3_conv/kernel:0, %conv3_block1_3_conv/bias:0)
  %convolution_output131 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block1_preact_relu/Relu:0, %conv3_block1_0_conv/kernel:0, %conv3_block1_0_conv/bias:0)
  %conv3_block1_out/add:0 = Add(%convolution_output131, %convolution_output132)
  %batch_norm_output_buffer143 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block1_out/add:0, %scale143, %bias143, %mean143, %var143)
  %conv3_block2_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer143)
  %convolution_output144 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block2_preact_relu/Relu:0, %conv3_block2_1_conv/kernel:0)
  %batch_norm_output_buffer136 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output144, %scale136, %bias136, %mean136, %var136)
  %conv3_block2_1_relu/Relu:0 = Relu(%batch_norm_output_buffer136)
  %conv3_block2_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block2_1_relu/Relu:0, %Pad45_pads, %Pad45_value)
  %convolution_output136 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv3_block2_1_relu/Relu:0_permuted_padded, %conv3_block2_2_conv/kernel:0)
  %batch_norm_output_buffer126 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output136, %scale126, %bias126, %mean126, %var126)
  %conv3_block2_2_relu/Relu:0 = Relu(%batch_norm_output_buffer126)
  %convolution_output128 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block2_2_relu/Relu:0, %conv3_block2_3_conv/kernel:0, %conv3_block2_3_conv/bias:0)
  %conv3_block2_out/add:0 = Add(%conv3_block1_out/add:0, %convolution_output128)
  %batch_norm_output_buffer141 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block2_out/add:0, %scale141, %bias141, %mean141, %var141)
  %conv3_block3_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer141)
  %convolution_output142 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block3_preact_relu/Relu:0, %conv3_block3_1_conv/kernel:0)
  %batch_norm_output_buffer134 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output142, %scale134, %bias134, %mean134, %var134)
  %conv3_block3_1_relu/Relu:0 = Relu(%batch_norm_output_buffer134)
  %conv3_block3_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block3_1_relu/Relu:0, %Pad44_pads, %Pad44_value)
  %convolution_output134 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv3_block3_1_relu/Relu:0_permuted_padded, %conv3_block3_2_conv/kernel:0)
  %batch_norm_output_buffer124 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output134, %scale124, %bias124, %mean124, %var124)
  %conv3_block3_2_relu/Relu:0 = Relu(%batch_norm_output_buffer124)
  %convolution_output126 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block3_2_relu/Relu:0, %conv3_block3_3_conv/kernel:0, %conv3_block3_3_conv/bias:0)
  %conv3_block3_out/add:0 = Add(%conv3_block2_out/add:0, %convolution_output126)
  %batch_norm_output_buffer140 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block3_out/add:0, %scale140, %bias140, %mean140, %var140)
  %conv3_block4_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer140)
  %convolution_output141 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block4_preact_relu/Relu:0, %conv3_block4_1_conv/kernel:0)
  %batch_norm_output_buffer132 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output141, %scale132, %bias132, %mean132, %var132)
  %conv3_block4_1_relu/Relu:0 = Relu(%batch_norm_output_buffer132)
  %conv3_block4_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block4_1_relu/Relu:0, %Pad43_pads, %Pad43_value)
  %convolution_output133 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv3_block4_1_relu/Relu:0_permuted_padded, %conv3_block4_2_conv/kernel:0)
  %batch_norm_output_buffer123 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output133, %scale123, %bias123, %mean123, %var123)
  %conv3_block4_2_relu/Relu:0 = Relu(%batch_norm_output_buffer123)
  %convolution_output124 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block4_2_relu/Relu:0, %conv3_block4_3_conv/kernel:0, %conv3_block4_3_conv/bias:0)
  %conv3_block4_out/add:0 = Add(%conv3_block3_out/add:0, %convolution_output124)
  %batch_norm_output_buffer137 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block4_out/add:0, %scale137, %bias137, %mean137, %var137)
  %conv3_block5_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer137)
  %convolution_output139 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block5_preact_relu/Relu:0, %conv3_block5_1_conv/kernel:0)
  %batch_norm_output_buffer131 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output139, %scale131, %bias131, %mean131, %var131)
  %conv3_block5_1_relu/Relu:0 = Relu(%batch_norm_output_buffer131)
  %conv3_block5_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block5_1_relu/Relu:0, %Pad42_pads, %Pad42_value)
  %convolution_output129 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv3_block5_1_relu/Relu:0_permuted_padded, %conv3_block5_2_conv/kernel:0)
  %batch_norm_output_buffer121 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output129, %scale121, %bias121, %mean121, %var121)
  %conv3_block5_2_relu/Relu:0 = Relu(%batch_norm_output_buffer121)
  %convolution_output123 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block5_2_relu/Relu:0, %conv3_block5_3_conv/kernel:0, %conv3_block5_3_conv/bias:0)
  %conv3_block5_out/add:0 = Add(%conv3_block4_out/add:0, %convolution_output123)
  %batch_norm_output_buffer135 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block5_out/add:0, %scale135, %bias135, %mean135, %var135)
  %conv3_block6_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer135)
  %convolution_output137 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block6_preact_relu/Relu:0, %conv3_block6_1_conv/kernel:0)
  %batch_norm_output_buffer127 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output137, %scale127, %bias127, %mean127, %var127)
  %conv3_block6_1_relu/Relu:0 = Relu(%batch_norm_output_buffer127)
  %conv3_block6_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block6_1_relu/Relu:0, %Pad41_pads, %Pad41_value)
  %convolution_output127 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv3_block6_1_relu/Relu:0_permuted_padded, %conv3_block6_2_conv/kernel:0)
  %batch_norm_output_buffer120 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output127, %scale120, %bias120, %mean120, %var120)
  %conv3_block6_2_relu/Relu:0 = Relu(%batch_norm_output_buffer120)
  %convolution_output120 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block6_2_relu/Relu:0, %conv3_block6_3_conv/kernel:0, %conv3_block6_3_conv/bias:0)
  %conv3_block6_out/add:0 = Add(%conv3_block5_out/add:0, %convolution_output120)
  %batch_norm_output_buffer133 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block6_out/add:0, %scale133, %bias133, %mean133, %var133)
  %conv3_block7_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer133)
  %convolution_output135 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block7_preact_relu/Relu:0, %conv3_block7_1_conv/kernel:0)
  %batch_norm_output_buffer125 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output135, %scale125, %bias125, %mean125, %var125)
  %conv3_block7_1_relu/Relu:0 = Relu(%batch_norm_output_buffer125)
  %conv3_block7_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block7_1_relu/Relu:0, %Pad40_pads, %Pad40_value)
  %convolution_output125 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv3_block7_1_relu/Relu:0_permuted_padded, %conv3_block7_2_conv/kernel:0)
  %batch_norm_output_buffer118 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output125, %scale118, %bias118, %mean118, %var118)
  %conv3_block7_2_relu/Relu:0 = Relu(%batch_norm_output_buffer118)
  %convolution_output118 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block7_2_relu/Relu:0, %conv3_block7_3_conv/kernel:0, %conv3_block7_3_conv/bias:0)
  %conv3_block7_out/add:0 = Add(%conv3_block6_out/add:0, %convolution_output118)
  %batch_norm_output_buffer128 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block7_out/add:0, %scale128, %bias128, %mean128, %var128)
  %conv3_block8_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer128)
  %convolution_output130 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block8_preact_relu/Relu:0, %conv3_block8_1_conv/kernel:0)
  %batch_norm_output_buffer122 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output130, %scale122, %bias122, %mean122, %var122)
  %conv3_block8_1_relu/Relu:0 = Relu(%batch_norm_output_buffer122)
  %conv3_block8_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv3_block8_1_relu/Relu:0, %Pad39_pads, %Pad39_value)
  %convolution_output121 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [2, 2]](%conv3_block8_1_relu/Relu:0_permuted_padded, %conv3_block8_2_conv/kernel:0)
  %batch_norm_output_buffer114 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output121, %scale114, %bias114, %mean114, %var114)
  %conv3_block8_2_relu/Relu:0 = Relu(%batch_norm_output_buffer114)
  %convolution_output115 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv3_block8_2_relu/Relu:0, %conv3_block8_3_conv/kernel:0, %conv3_block8_3_conv/bias:0)
  %conv3_block7_out/add:0_pooling0 = MaxPool[auto_pad = 'VALID', ceil_mode = 0, kernel_shape = [1, 1], strides = [2, 2]](%conv3_block7_out/add:0)
  %conv3_block8_out/add:0 = Add(%conv3_block7_out/add:0_pooling0, %convolution_output115)
  %batch_norm_output_buffer104 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv3_block8_out/add:0, %scale104, %bias104, %mean104, %var104)
  %conv4_block1_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer104)
  %convolution_output122 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv4_block1_preact_relu/Relu:0, %conv4_block1_1_conv/kernel:0)
  %batch_norm_output_buffer115 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output122, %scale115, %bias115, %mean115, %var115)
  %conv4_block1_1_relu/Relu:0 = Relu(%batch_norm_output_buffer115)
  %conv4_block1_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv4_block1_1_relu/Relu:0, %Pad38_pads, %Pad38_value)
  %convolution_output113 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv4_block1_1_relu/Relu:0_permuted_padded, %conv4_block1_2_conv/kernel:0)
  %batch_norm_output_buffer105 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output113, %scale105, %bias105, %mean105, %var105)
  %conv4_block1_2_relu/Relu:0 = Relu(%batch_norm_output_buffer105)
  %convolution_output106 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv4_block1_2_relu/Relu:0, %conv4_block1_3_conv/kernel:0, %conv4_block1_3_conv/bias:0)
  %convolution_output105 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv4_block1_preact_relu/Relu:0, %conv4_block1_0_conv/kernel:0, %conv4_block1_0_conv/bias:0)
  %conv4_block1_out/add:0 = Add(%convolution_output105, %convolution_output106)
  %batch_norm_output_buffer119 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv4_block1_out/add:0, %scale119, %bias119, %mean119, %var119)
  %conv4_block2_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer119)
  %convolution_output119 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv4_block2_preact_relu/Relu:0, %conv4_block2_1_conv/kernel:0)
  %batch_norm_output_buffer112 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output119, %scale112, %bias112, %mean112, %var112)
  %conv4_block2_1_relu/Relu:0 = Relu(%batch_norm_output_buffer112)
  %conv4_block2_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv4_block2_1_relu/Relu:0, %Pad37_pads, %Pad37_value)
  %convolution_output111 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv4_block2_1_relu/Relu:0_permuted_padded, %conv4_block2_2_conv/kernel:0)
  %batch_norm_output_buffer101 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output111, %scale101, %bias101, %mean101, %var101)
  %conv4_block2_2_relu/Relu:0 = Relu(%batch_norm_output_buffer101)
  %convolution_output102 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv4_block2_2_relu/Relu:0, %conv4_block2_3_conv/kernel:0, %conv4_block2_3_conv/bias:0)
  %conv4_block2_out/add:0 = Add(%conv4_block1_out/add:0, %convolution_output102)
  %batch_norm_output_buffer117 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%conv4_block2_out/add:0, %scale117, %bias117, %mean117, %var117)
  %conv4_block3_preact_relu/Relu:0 = Relu(%batch_norm_output_buffer117)
  %convolution_output117 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [1, 1], strides = [1, 1]](%conv4_block3_preact_relu/Relu:0, %conv4_block3_1_conv/kernel:0)
  %batch_norm_output_buffer110 = BatchNormalization[epsilon = 1.00099999400527e-08, momentum = 0.990000009536743](%convolution_output117, %scale110, %bias110, %mean110, %var110)
  %conv4_block3_1_relu/Relu:0 = Relu(%batch_norm_output_buffer110)
  %conv4_block3_1_relu/Relu:0_permuted_padded = Pad[mode = 'constant'](%conv4_block3_1_relu/Relu:0, %Pad36_pads, %Pad36_value)
  %convolution_output109 = Conv[auto_pad = 'VALID', dilations = [1, 1], group = 1, kernel_shape = [3, 3], strides = [1, 1]](%conv4_block3_1_relu/Relu:0_permuted_padded, %conv4_block3_2_conv/kernel:0)
